{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Variables"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import des librairies"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import code.filemanagement as fm\n",
    "import code.wikidata as wd\n",
    "import code.ontorefine as otr\n",
    "import code.graphdb as gd\n",
    "import code.graphrdf as gr\n",
    "import code.strprocessing as sp\n",
    "from rdflib import Graph, Namespace, URIRef, Literal, BNode, XSD"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Définition des variables globales"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Fichiers existants\n",
    "addr_ont_file_name = \"address_ont.ttl\"\n",
    "ev_ont_file_name = \"events_ont.ttl\"\n",
    "\n",
    "# Fichiers créés durant le processus\n",
    "export_file_name = \"addresses-temp.ttl\"\n",
    "out_file_name = \"addresses.ttl\"\n",
    "local_config_file_name = \"config_repo.ttl\"\n",
    "\n",
    "tmp_folder_name = \"tmp_files\"\n",
    "source_folder_name = \"sources\"\n",
    "mapping_folder_name = \"mappings\"\n",
    "wikidata_folder_name = \"wikidata\"\n",
    "\n",
    "project_name = \"voies_paris_hist\" \n",
    "graphdb_url = \"http://localhost:7200\"\n",
    "local_uri = \"http://rdf.geohistoricaldata.org/address#\"\n",
    "\n",
    "wd_graph_name = \"wikidata\"\n",
    "addr_graph_name = \"local_street\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Traitement des variables globales\n",
    "\n",
    "* Obtention des chemins absolus des fichiers à partir des chemins relatifs donnés dans la section précédente\n",
    "* Création d'un dossier temporaire s'il n'existe pas encore pour stocker des fichiers à vocation d'être supprimés"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "tmp_folder = os.path.abspath(tmp_folder_name)\n",
    "wikidata_folder = os.path.join(tmp_folder, wikidata_folder_name)\n",
    "source_folder = os.path.abspath(source_folder_name)\n",
    "mapping_folder = os.path.abspath(mapping_folder_name)\n",
    "\n",
    "fm.create_folder_if_not_exists(tmp_folder)\n",
    "fm.create_folder_if_not_exists(wikidata_folder)\n",
    "\n",
    "local_config_file = os.path.join(tmp_folder, local_config_file_name)\n",
    "addr_ont_file = os.path.abspath(addr_ont_file_name)\n",
    "ev_ont_file = os.path.abspath(ev_ont_file_name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Gestion du répertoire local"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Création du répertoire local dans GraphDB\n",
    "Pour que la création marche, il faut que GraphDB soit lancé et donc que l'URI donné par `graphdb_url` fonctionne. Si le répertoire existe déjà, rien n'est fait"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{\"message\":\"Repository voies_paris_hist already exists.\"}"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  1649    0    57  100  1592    887  24775 --:--:-- --:--:-- --:--:-- 25765\n"
     ]
    }
   ],
   "source": [
    "gd.create_config_local_repository_file(local_config_file, project_name)\n",
    "gd.create_repository_from_config_file(graphdb_url, local_config_file)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Vidage du répertoire local\n",
    "Le répertoire dont l'id est `project_name` pour y stocker les données récupérées, cela est utile si le répertoire existait déjà."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "# gd.clear_repository(graphdb_url, project_name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import des ontologies"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 19366    0     0  100 19366      0   112k --:--:-- --:--:-- --:--:--  112k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 20197    0     0  100 20197      0   8547  0:00:02  0:00:02 --:--:--  8550\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "''"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gd.import_ttl_file_in_graphdb(graphdb_url, project_name, addr_ont_file)\n",
    "gd.import_ttl_file_in_graphdb(graphdb_url, project_name, ev_ont_file)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Import des données de Wikidata\n",
    "Récupération des fichiers ttl d'éléments de Wikidata (voies, quartiers, arrondissements de Paris). Ensuite ces fichiers sont importés dans le répertoire local."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Récupération des éléments de Wikidata\n",
    "Pour chaque élément Wikidata décrivant une rue de Paris, on extrait un fichier `ttl` le décrivant.\n",
    "Ce processus peut prendre du temps (environ 1 heure et demie) du fait du nombre d'éléments à récupérer (presque 7000)."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Création des requêtes\n",
    "Création des requêtes pour récupérer les données liées aux voies de Paris et une autre pour avoir les zones de la ville (quartiers administratifs et arrondissements)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "qid_variable = \"qid\"\n",
    "\n",
    "query_streets = f\"\"\"\n",
    "SELECT DISTINCT ?{qid_variable}\n",
    "WHERE {{\n",
    "{{?{qid_variable} p:P361 [ps:P361 wd:Q16024163].}}\n",
    "UNION\n",
    "{{?{qid_variable} p:P361 [ps:P361 wd:Q107311481].}}\n",
    "}}\n",
    "ORDER BY ?{qid_variable}\n",
    "\"\"\"\n",
    "\n",
    "query_areas = f\"\"\"\n",
    "SELECT DISTINCT ?qid WHERE {{\n",
    "  {{BIND (wd:Q90 AS ?{qid_variable}) }}\n",
    "  UNION{{?{qid_variable} p:P31 [ps:P31 wd:Q252916].}}\n",
    "  UNION{{?{qid_variable} p:P31 [ps:P31 wd:Q702842]; p:P131 [ps:P131 wd:Q90].}}\n",
    "}}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Lancement des requêtes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "# # Décommenter ces lignes pour récupérer les données\n",
    "\n",
    "# # Récupération des voies de Paris\n",
    "# wd.get_ttl_files_from_wikidata_query(query_streets, qid_variable, wikidata_folder, flavor=\"dump\")\n",
    "\n",
    "# #Récupération des zones de Paris\n",
    "# wd.get_ttl_files_from_wikidata_query(query_areas, qid_variable, wikidata_folder, flavor=\"dump\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import des fichiers `ttl` venant de Wikidata\n",
    "Importer tous les fichiers ttl dans un graphe nommé défini par `wd_graph_name` dans le répertoire (une vingtaine de minutes pour 7000 fichiers)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "# gd.upload_ttl_folder_in_graphdb_repository(wikidata_folder, graphdb_url, project_name, wd_graph_name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Traitements pour créer / importer des données"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Requêtes SPARQL pour construire le graphe des rues de Paris à partir de Wikidata"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    ":warning: Impossible de chaîner les requêtes sur le endpoint de Wikidata, d'où la séparation de celles-ci sous plusieurs variables\n",
    "\n",
    "Note : `wd:Q16024163` décrit l'élément `réseau viaire de Paris` donc le triplet `?street p:P361 [ps:P361 wd:Q16024163].` permet de sélectionner les élements qui font partie de ce réseau. `wd:Q107311481` est similaire à la différence qu'il décrit l'élément `anciennes voies de Paris`.\n",
    "\n",
    "* `query_1` : création des voies de Paris via un élément Wikidata décrivant une voie du réseau, initialisation d'une ressource décrivant un attribut de type nom\n",
    "* `query_2` : sélection des voies de Paris avec l'ensemble de leur nom officiel avec si elles existent les dates de début et de fin de validité du nom officiel pour la voie\n",
    "* `query_3` : sélection (si elles existent) des dates de création et de disparition des voies de Paris\n",
    "* `query_4` : similaire à `query_1` mais repose sur les quartiers et arrondissement de Paris\n",
    "* `query_5` : ajout de la localisation des entités géographiques\n",
    "* `query_6` : ajout de données annexes aux entités géographiques (label, alias)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  2464    0  2464    0     0   355k      0 --:--:-- --:--:-- --:--:--  401k\n"
     ]
    }
   ],
   "source": [
    "# Récupération de l'URI des graphes à partir de leur nom\n",
    "wd_graph_name_uri = gd.get_graph_uri_from_name(graphdb_url, project_name, wd_graph_name)\n",
    "addr_graph_name_uri = gd.get_graph_uri_from_name(graphdb_url, project_name, addr_graph_name)\n",
    "local_uri = \"http://rdf.geohistoricaldata.org/address#\"\n",
    "\n",
    "# Récupération des préfixes pour les requêtes\n",
    "# Ajout du préfixe `ofn` au cas où il existe pas...\n",
    "perso_namespaces = {\"ofn\":\"http://www.ontotext.com/sparql/functions/\"}\n",
    "prefixes = gd.get_repository_prefixes(graphdb_url, project_name, perso_namespaces)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Structurer les rues de Paris, et les zones selon notre modèle\n",
    "\n",
    "# Vider le graphe `addr_graph_name_uri`\n",
    "query0 = prefixes + f\"\"\"\n",
    "DELETE {{ ?s ?p ?o }}\n",
    "WHERE {{ GRAPH <{addr_graph_name_uri}> {{ ?s ?p ?o }} }}\n",
    "\"\"\"\n",
    "\n",
    "# Création des rues de Paris et ajout d'un lien owl:sameAs avec son équivalent sur Wikidata\n",
    "query1 = prefixes + f\"\"\"\n",
    "INSERT {{\n",
    "  GRAPH <{addr_graph_name_uri}> {{\n",
    "    ?landmark a addr:Landmark;\n",
    "            addr:isLandmarkType addr:Thoroughfare;\n",
    "            addr:hasAttribute ?attrName;\n",
    "            owl:sameAs ?street.\n",
    "    ?attrName a addr:Attribute; addr:isAttributeType addr:NameAttribute.\n",
    "  }}\n",
    "}}\n",
    "WHERE {{\n",
    "  {{\n",
    "    SELECT * WHERE {{\n",
    "      {{ ?street p:P361 [ps:P361 wd:Q16024163]. }}\n",
    "      UNION\n",
    "      {{ ?street p:P361 [ps:P361 wd:Q107311481]. }}\n",
    "    }}\n",
    "  }}\n",
    "  BIND(URI(CONCAT(\"{local_uri}LM_\", STRUUID())) AS ?landmark)\n",
    "  BIND(URI(CONCAT(\"{local_uri}AN_\", STRUUID())) AS ?attrName)\n",
    "  }}\n",
    "\"\"\"\n",
    "\n",
    "# Obtention des noms officiels des rues\n",
    "query2 = prefixes + f\"\"\"\n",
    "INSERT {{\n",
    "  GRAPH <{addr_graph_name_uri}> {{\n",
    "    ?attrName addr:version ?attrNameVersion.\n",
    "    ?attrNameVersion owl:sameAs ?officialNameSt; a addr:AttributeVersion; addr:value ?officialName.\n",
    "    ?startEvent a addr:Event; addr:hasTime ?startTimeInstant.\n",
    "    ?endEvent a addr:Event; addr:hasTime ?endTimeInstant.\n",
    "    ?startChange a addr:AttributeChange; addr:isChangeType addr:NameChange; addr:dependsOn ?startEvent; addr:appliedTo ?attrName; addr:after ?attrNameVersion.\n",
    "    ?endChange a addr:AttributeChange; addr:isChangeType addr:NameChange; addr:dependsOn ?endEvent; addr:appliedTo ?attrName; addr:before ?attrNameVersion.\n",
    "    ?startTimeInstant a addr:TimeInstant; addr:timeStamp ?startDateValue; addr:timePrecision ?startDatePrec; addr:timeCalendar ?startDateCal.\n",
    "    ?endTimeInstant a addr:TimeInstant; addr:timeStamp ?endDateValue; addr:timePrecision ?endDatePrec; addr:timeCalendar ?endDateCal.\n",
    "  }}\n",
    "}}\n",
    "WHERE {{\n",
    "  {{\n",
    "    SELECT * WHERE {{\n",
    "      ?landmark a addr:Landmark; addr:isLandmarkType addr:Thoroughfare; owl:sameAs [p:P1448 ?officialNameSt]; addr:hasAttribute ?attrName.\n",
    "      ?attrName a addr:Attribute; addr:isAttributeType addr:NameAttribute.\n",
    "      ?officialNameSt ps:P1448 ?officialName.\n",
    "      OPTIONAL{{?officialNameSt pqv:P580 [wikibase:timeValue ?startDateValue; wikibase:timePrecision ?startDatePrec; wikibase:timeCalendarModel ?startDateCal]}}\n",
    "      OPTIONAL{{?officialNameSt pqv:P582 [wikibase:timeValue ?endDateValue; wikibase:timePrecision ?endDatePrec; wikibase:timeCalendarModel ?endDateCal]}}\n",
    "      FILTER (LANG(?officialName) = \"fr\")\n",
    "    }}\n",
    "  }}\n",
    "  BIND(URI(CONCAT(\"{local_uri}ANV_\", STRUUID())) AS ?attrNameVersion)\n",
    "  BIND(URI(CONCAT(\"{local_uri}EV_\", STRUUID())) AS ?startEvent)\n",
    "  BIND(URI(CONCAT(\"{local_uri}CH_\", STRUUID())) AS ?startChange)\n",
    "  BIND(URI(CONCAT(\"{local_uri}EV_\", STRUUID())) AS ?endEvent)\n",
    "  BIND(URI(CONCAT(\"{local_uri}CH_\", STRUUID())) AS ?endChange)\n",
    "  BIND(URI(CONCAT(\"{local_uri}TE_\", STRUUID())) AS ?startTimeInstant)\n",
    "  BIND(URI(CONCAT(\"{local_uri}TE_\", STRUUID())) AS ?endTimeInstant)\n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "# Obtention des dates de création et des dissolution des rues\n",
    "query3 = prefixes + f\"\"\"\n",
    "INSERT {{\n",
    "  GRAPH <{addr_graph_name_uri}> {{\n",
    "    ?startEvent a addr:Event; addr:hasTime ?startTimeInstant.\n",
    "    ?endEvent a addr:Event; addr:hasTime ?endTimeInstant.\n",
    "    ?startChange a addr:LandmarkChange; addr:isChangeType addr:LandmarkCreation; addr:appliedTo ?landmark; addr:dependsOn ?startEvent.\n",
    "    ?endChange a addr:LandmarkChange; addr:isChangeType addr:LandmarkDissolution; addr:appliedTo ?landmark; addr:dependsOn ?endEvent.\n",
    "    ?startTimeInstant a addr:TimeInstant; addr:timeStamp ?creationTimeValue; addr:timePrecision ?creationTimePrec; addr:timeCalendar ?creationTimeCal.\n",
    "    ?endTimeInstant a addr:TimeInstant; addr:timeStamp ?dissolutionTimeValue; addr:timePrecision ?dissolutionTimePrec; addr:timeCalendar ?dissolutionTimeCal.\n",
    "  }}\n",
    "}}\n",
    "WHERE {{\n",
    "  {{\n",
    "    SELECT * WHERE {{\n",
    "      ?landmark a addr:Landmark; addr:isLandmarkType addr:Thoroughfare; owl:sameAs ?street.\n",
    "      OPTIONAL {{ ?street p:P571 [psv:P571 [wikibase:timeValue ?creationTimeValue; wikibase:timePrecision ?creationTimePrec; wikibase:timeCalendarModel ?creationTimeCal]]. }}\n",
    "      OPTIONAL {{ ?street p:P576 [psv:P576 [wikibase:timeValue ?dissolutionTimeValue; wikibase:timePrecision ?dissolutionTimePrec; wikibase:timeCalendarModel ?dissolutionTimeCal]]. }}\n",
    "    }}\n",
    "  }}\n",
    "  BIND(URI(CONCAT(\"{local_uri}EV_\", STRUUID())) AS ?startEvent)\n",
    "  BIND(URI(CONCAT(\"{local_uri}CH_\", STRUUID())) AS ?startChange)\n",
    "  BIND(URI(CONCAT(\"{local_uri}EV_\", STRUUID())) AS ?endEvent)\n",
    "  BIND(URI(CONCAT(\"{local_uri}CH_\", STRUUID())) AS ?endChange)\n",
    "  BIND(URI(CONCAT(\"{local_uri}TE_\", STRUUID())) AS ?startTimeInstant)\n",
    "  BIND(URI(CONCAT(\"{local_uri}TE_\", STRUUID())) AS ?endTimeInstant)\n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "# Données relatives aux arrondissements, aux quartiers de Paris et à la ville\n",
    "query4 = prefixes + f\"\"\"\n",
    "INSERT {{ GRAPH <{addr_graph_name_uri}> {{\n",
    "  ?landmark a addr:Landmark;\n",
    "           addr:isLandmarkType ?landmarkType;\n",
    "           owl:sameAs ?qid.\n",
    "  }}\n",
    "}}\n",
    "WHERE {{\n",
    "  {{\n",
    "    SELECT * WHERE {{\n",
    "      {{BIND (wd:Q90 AS ?qid) }}\n",
    "      UNION{{?qid p:P31 [ps:P31 wd:Q252916].}}\n",
    "      UNION{{?qid p:P31 [ps:P31 wd:Q702842]; p:P131 [ps:P131 wd:Q90].}}\n",
    "      ?qid p:P31 [ps:P31 ?wdLandmarkType].\n",
    "      BIND(\n",
    "        IF(?wdLandmarkType = wd:Q252916, addr:District,\n",
    "            IF(?wdLandmarkType = wd:Q252916, addr:District,\n",
    "                IF(?wdLandmarkType = wd:Q484170, addr:City, ?x))) AS ?landmarkType)\n",
    "      FILTER(BOUND(?landmarkType))\n",
    "    }}\n",
    "  }}\n",
    "    BIND(URI(CONCAT(\"{local_uri}LM_\", STRUUID())) AS ?landmark)\n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "# Obtention des localisations des objets (rues, quartiers et arrondissements)\n",
    "query5 = prefixes + f\"\"\"\n",
    "INSERT {{ GRAPH <{addr_graph_name_uri}> {{\n",
    "  ?landmarkRelation a addr:LandmarkRelation; addr:isLandmarkRelationType addr:Within; addr:locatum ?landmark; addr:relatum ?loc.\n",
    "  ?startEvent a addr:Event.\n",
    "  ?endEvent a addr:Event.\n",
    "  ?startChange a addr:LandmarkRelationChange; addr:isChangeType addr:RelationCreation; addr:appliedTo ?landmarkRelation; addr:dependsOn ?startEvent.\n",
    "  ?endChange a addr:LandmarkRelationChange; addr:isChangeType addr:RelationDissolution; addr:appliedTo ?landmarkRelation; addr:dependsOn ?endEvent.\n",
    "  }} \n",
    "}}\n",
    "WHERE {{\n",
    "  {{\n",
    "    SELECT * WHERE {{\n",
    "      ?landmark owl:sameAs ?wdLandmark.\n",
    "      ?wdLandmark p:P131 [ps:P131 ?wdLoc].\n",
    "      ?loc owl:sameAs ?wdLoc.\n",
    "    }}\n",
    "  }}\n",
    "  BIND(URI(CONCAT(\"{local_uri}LMR_\", STRUUID())) AS ?landmarkRelation)\n",
    "  BIND(URI(CONCAT(\"{local_uri}EV_\", STRUUID())) AS ?startEvent)\n",
    "  BIND(URI(CONCAT(\"{local_uri}CH_\", STRUUID())) AS ?startChange)\n",
    "  BIND(URI(CONCAT(\"{local_uri}EV_\", STRUUID())) AS ?endEvent)\n",
    "  BIND(URI(CONCAT(\"{local_uri}CH_\", STRUUID())) AS ?endChange)\n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "# Ajout des noms des objets (labels et alias)\n",
    "query6 = prefixes + f\"\"\"\n",
    "INSERT {{ GRAPH <{addr_graph_name_uri}> {{\n",
    " ?landmark rdfs:label ?wdLandmarkLabel;\n",
    "           skos:altLabel ?wdLandmarkAltLabel.\n",
    "}} \n",
    "}}\n",
    "WHERE {{\n",
    "  ?landmark a addr:Landmark; owl:sameAs ?wdLandmark.\n",
    "  ?wdLandmark rdfs:label ?wdLandmarkLabel.\n",
    "  FILTER (LANG(?wdLandmarkLabel) = \"fr\")\n",
    "  OPTIONAL {{?wdLandmark skos:altLabel ?wdLandmarkAltLabel. FILTER (LANG(?wdLandmarkAltLabel) = \"fr\")}}\n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "wiki_queries = [query0, query1, query2, query3, query4, query5, query6]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Création d'un graphe nommé stockant les rues selon l'ontologie définie à partir des données de Wikidata"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  3993    0     0  100  3993      0    124  0:00:32  0:00:32 --:--:--     0\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  4897    0     0  100  4897      0   5702 --:--:-- --:--:-- --:--:--  5700\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  7058    0     0  100  7058      0   1124  0:00:06  0:00:06 --:--:--     0\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  6433    0     0  100  6433      0   1365  0:00:04  0:00:04 --:--:--     0\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  5147    0     0  100  5147      0   7064 --:--:-- --:--:-- --:--:--  7070\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  5551    0     0  100  5551      0   1005  0:00:05  0:00:05 --:--:--     0\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  4439    0     0  100  4439      0  11966 --:--:-- --:--:-- --:--:-- 11997\n"
     ]
    }
   ],
   "source": [
    "for query in wiki_queries:\n",
    "    gd.update_query(query, graphdb_url, project_name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Traitements après l'import de données\n",
    "\n",
    "* `loc_query_1` : remplace les précisions (liées à `addr:timePrecision`) qui sont des entiers (voir https://www.wikidata.org/wiki/Help:Dates/fr) par une ressource de l'ontologie OWL Time (des sous-classes de `time:TemporalUnit`)\n",
    "* `loc_query_2` : lors de la construction du graphe via les requêtes de la section précédente, chaque version des noms (`nomVersion`) est associée à deux changements définissant son début et sa fin de validité (`changementDebut` et `changementFin`) qui dépendent chacun d'un événement (`evenementDebut` et `evenementFin`). Lorsqu'une voie change de nom, soit passe de `nomVersion1` à `nomVersion2`, `changementFin1` et `changementDebut2` définissent la même chose (la fin de validité de `nomVersion1` implique le début de validité de `nomVersion2`). Cette requête permet de faire la fusion de ces changements et ainsi des événéments qui en dépendent.\n",
    "* `loc_query_3` : similaire à la requête `loc_query_2` mais s'applique aux repères ;\n",
    "* `loc_query_4` : suppression d'éléments de type `addr:TimeInstant` qui n'ont pas de propriété `addr:timeStamp`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Remplacement de la précision donnée par un entier (voir https://www.wikidata.org/wiki/Help:Dates/fr) par une ressource de l'ontologie OWL Time\n",
    "loc_query_1 = prefixes + f\"\"\"\n",
    "DELETE {{ \n",
    "    ?timeInstant addr:timePrecision ?timePrecision.\n",
    "}}\n",
    "INSERT {{\n",
    "    GRAPH <{addr_graph_name_uri}> {{\n",
    "        ?timeInstant addr:timePrecision ?timeUnit.\n",
    "    }} \n",
    "}}\n",
    "WHERE {{ \n",
    "    GRAPH <{addr_graph_name_uri}> {{\n",
    "        ?timeInstant a addr:TimeInstant; addr:timePrecision ?timePrecision.\n",
    "        FILTER (DATATYPE(?timePrecision) = xsd:integer)\n",
    "            BIND(IF(?timePrecision = 11, time:unitDay, \n",
    "                    IF(?timePrecision = 10, time:unitMonth,\n",
    "                        IF(?timePrecision = 9, time:unitYear,\n",
    "                            IF(?timePrecision = 8, time:unitDecade,\n",
    "                                IF(?timePrecision = 7, time:unitCentury,\n",
    "                                    IF(?timePrecision = 6, time:unitMillenium, ?x\n",
    "                                )))))) AS ?timeUnit)\n",
    "    }} \n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "loc_query_2 = prefixes + f\"\"\"\n",
    "DELETE {{\n",
    "    ?change1 ?p ?o.\n",
    "    ?event1 ?pe ?oe.\n",
    "    ?se ?pe ?event1.\n",
    "    ?timeInstant1 a addr:timeInstant; addr:timeStamp ?timeStamp1; addr:timePrecision ?timePrec1; addr:timeCalendar ?timeCal1.\n",
    "}}\n",
    "INSERT {{\n",
    "    GRAPH <{addr_graph_name_uri}> {{\n",
    "        ?change2 addr:before ?attrNameVersion1.\n",
    "    }}\n",
    "}}\n",
    "WHERE {{\n",
    "    ?attrName a addr:Attribute; addr:isAttributeType addr:NameAttribute; addr:version ?attrNameVersion1, ?attrNameVersion2.\n",
    "    ?attrNameVersion1 a addr:AttributeVersion.\n",
    "    ?attrNameVersion2 a addr:AttributeVersion.\n",
    "    FILTER (?attrNameVersion1 != ?attrNameVersion2)\n",
    "    ?change1 a addr:AttributeChange; addr:before ?attrNameVersion1; addr:dependsOn ?event1.\n",
    "    ?event1 a addr:Event; addr:hasTime ?timeInstant1. \n",
    "    ?timeInstant1 a addr:TimeInstant; addr:timeStamp ?timeStamp1; addr:timePrecision ?timePrec1; addr:timeCalendar ?timeCal1.\n",
    "    ?change2 a addr:AttributeChange; addr:after ?attrNameVersion2; addr:dependsOn [a addr:Event; addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeStamp2; addr:timePrecision ?timePrec2; addr:timeCalendar ?timeCal2]].\n",
    "    BIND(ofn:asDays(?timeStamp2 - ?timeStamp1) AS ?diffTime)\n",
    "    FILTER(?diffTime >= 0.0 && ?timeCal1 = ?timeCal2)\n",
    "    FILTER ((?diffTime <= 1.0 && ?timePrec1 = time:unitDay && ?timePrec2 = time:unitDay) ||\n",
    "         (?diffTime <= 0 && ?timePrec1 != time:unitDay && ?timePrec2 != time:unitDay))\n",
    "    ?change1 ?p ?o.\n",
    "    {{?event1 ?pe ?oe}}UNION{{?se ?pe ?event1}}\n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "loc_query_3 = prefixes + f\"\"\"\n",
    "DELETE {{\n",
    "    ?creaEv ?p ?o.\n",
    "    ?s ?p ?creaEv.\n",
    "    ?crevEvTime a addr:TimeInstant; addr:timePrecision ?creaEvTimePrec; addr:timeStamp ?creaEvTimeVal; addr:timeCalendar ?creaEvTimeCal.\n",
    "}}\n",
    "INSERT {{ GRAPH <{addr_graph_name_uri}> {{\n",
    "    ?lmCrea addr:dependsOn ?attrNameEv.\n",
    "}} }}\n",
    "WHERE {{\n",
    "    ?lmCrea a addr:LandmarkChange; addr:isChangeType addr:LandmarkCreation; addr:appliedTo ?landmark; addr:dependsOn ?creaEv.\n",
    "    ?creaEv a addr:Event; addr:hasTime ?crevEvTime.\n",
    "    ?crevEvTime a addr:TimeInstant; addr:timePrecision ?creaEvTimePrec; addr:timeStamp ?creaEvTimeVal; addr:timeCalendar ?creaEvTimeCal.\n",
    "    ?landmark a addr:Landmark; addr:isLandmarkType addr:Thoroughfare; addr:hasAttribute ?nameAttr.\n",
    "    ?attrNameChange a addr:AttributeChange; addr:appliedTo ?nameAttr; addr:dependsOn ?attrNameEv.\n",
    "    ?attrNameEv a addr:Event; addr:hasTime ?attrNameEvTime. \n",
    "    ?attrNameEvTime a addr:TimeInstant; addr:timePrecision ?newNameEvTimePrec; addr:timeStamp ?newNameEvTimeVal; addr:timeCalendar ?newNameEvTimeCal.\n",
    "    FILTER(?attrNameEv != ?creaEv)\n",
    "    BIND(ofn:asDays(?creaEvTimeVal - ?newNameEvTimeVal) AS ?diffTime)\n",
    "    FILTER(?diffTime >= 0.0 && ?newNameEvTimeCal = ?creaEvTimeCal)\n",
    "    FILTER ((?diffTime <= 1.0 && ?creaEvTimePrec = time:unitDay && ?newNameEvTimePrec = time:unitDay) ||\n",
    "         (?diffTime <= 0 && ?creaEvTimePrec != time:unitDay && ?timePrec2 != time:newNameEvTimePrec))\n",
    "        {{?creaEv ?p ?o}}UNION{{?s ?p ?creaEv}}\n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "loc_query_4 = prefixes + f\"\"\"\n",
    "DELETE {{\n",
    "    ?timeInstant ?p ?o.\n",
    "    ?s ?p ?timeInstant.\n",
    "}}\n",
    "WHERE {{\n",
    "    ?timeInstant a addr:TimeInstant.\n",
    "    OPTIONAL {{ ?timeInstant addr:timeStamp ?timeStamp }}\n",
    "    FILTER (!BOUND(?timeStamp))\n",
    "    {{?timeInstant ?p ?o}}UNION{{?s ?p ?timeInstant}}\n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "loc_queries = [loc_query_1, loc_query_2, loc_query_3, loc_query_4]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Nettoyage des données en fusionnant certains événements et changements"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  5469    0     0  100  5469      0   2365  0:00:02  0:00:02 --:--:--  2365\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  6084    0     0  100  6084      0   1883  0:00:03  0:00:03 --:--:--  1883\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  6013    0     0  100  6013      0  11197 --:--:-- --:--:-- --:--:-- 11197\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  4216    0     0  100  4216      0    563  0:00:07  0:00:07 --:--:--     0\n"
     ]
    }
   ],
   "source": [
    "for loc_query in loc_queries:\n",
    "    gd.update_query(loc_query, graphdb_url, project_name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Requêtes pour faire des sélections dans le graphe"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Sélection des noms qu'a pris la place de la Nation durant sa vie\n",
    "query = \"\"\"\n",
    "PREFIX addr: <http://rdf.geohistoricaldata.org/address#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "\n",
    "SELECT ?street ?name ?timeValueStart ?timeValueEnd WHERE { \n",
    "\t?street a addr:Landmark; addr:isLandmarkType addr:Thoroughfare; addr:hasAttribute ?attrName; (rdfs:label|skos:altLabel) \"place de la Nation\"@fr.\n",
    "    ?attrName a addr:Attribute; addr:isAttributeType addr:NameAttribute; addr:version ?attrNameVersion.\n",
    "    ?attrNameVersion addr:value ?name.\n",
    "    ?changeEnd addr:before ?attrNameVersion; addr:appliedTo ?attrName; addr:dependsOn ?eventEnd.\n",
    "    ?changeStart addr:after ?attrNameVersion; addr:appliedTo ?attrName; addr:dependsOn ?eventStart.\n",
    "    ?eventEnd a addr:Event.\n",
    "    ?eventStart a addr:Event.\n",
    "    OPTIONAL {?eventEnd addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValueEnd]}\n",
    "    OPTIONAL {?eventEnd addr:hasTime [a addr:TimeInstant; addr:timePrecision ?timePrecisionEnd]}\n",
    "    OPTIONAL {?eventEnd addr:hasTime [a addr:TimeInstant; addr:timeCalendar ?timeCalendarEnd]}\n",
    "    OPTIONAL {?eventStart addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValueStart]}\n",
    "    OPTIONAL {?eventStart addr:hasTime [a addr:TimeInstant; addr:timePrecision ?timePrecisionStart]}\n",
    "    OPTIONAL {?eventStart addr:hasTime [a addr:TimeInstant; addr:timeCalendar ?timeCalendarStart]}\n",
    "    }\n",
    "\"\"\" \n",
    "\n",
    "# Sélection de l'historique des noms de la place de la Nation avec les dates\n",
    "query = \"\"\"\n",
    "PREFIX addr: <http://rdf.geohistoricaldata.org/address#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "\n",
    "SELECT ?street ?change ?event ?timeValue ?timePrecision ?timeCalendar ?beforeVersion ?afterVersion WHERE { \n",
    "\t?street a addr:Landmark; addr:isLandmarkType addr:Thoroughfare; addr:hasAttribute ?attrName; (rdfs:label|skos:altLabel) \"place de la Nation\"@fr.\n",
    "    ?attrName a addr:Attribute; addr:isAttributeType addr:NameAttribute.\n",
    "    ?change addr:appliedTo ?attrName; addr:dependsOn ?event.\n",
    "    ?event a addr:Event.\n",
    "    OPTIONAL {?event addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValue]}\n",
    "    OPTIONAL {?event addr:hasTime [a addr:TimeInstant; addr:timePrecision ?timePrecision]}\n",
    "    OPTIONAL {?event addr:hasTime [a addr:TimeInstant; addr:timeCalendar ?timeCalendar]}\n",
    "    OPTIONAL {?change addr:before [addr:value ?beforeVersion]}\n",
    "    OPTIONAL {?change addr:after [addr:value ?afterVersion]}\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "# Sélection du nom de la place de la Nation à une date donnée\n",
    "query = \"\"\"\n",
    "PREFIX addr: <http://rdf.geohistoricaldata.org/address#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT ?street ?name ?selectTime WHERE { \n",
    "\t?street a addr:Landmark; addr:isLandmarkType addr:Thoroughfare; addr:hasAttribute ?attrName; (rdfs:label|skos:altLabel) \"place de la Nation\"@fr.\n",
    "    BIND(\"1800-01-08T00:00:00\"^^xsd:dateTime AS ?selectTime)\n",
    "    ?attrName a addr:Attribute; addr:isAttributeType addr:NameAttribute; addr:version ?attrNameVersion.\n",
    "    ?attrNameVersion a addr:AttributeVersion; addr:value ?name.\n",
    "    ?change1 addr:before ?attrNameVersion; addr:dependsOn ?event1.\n",
    "    ?change2 addr:after ?attrNameVersion; addr:dependsOn ?event2.\n",
    "    ?event1 a addr:Event.\n",
    "    ?event2 a addr:Event.\n",
    "    OPTIONAL {?event1 addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValue1]}\n",
    "    OPTIONAL {?event1 addr:hasTime [a addr:TimeInstant; addr:timePrecision ?timePrecision1]}\n",
    "    OPTIONAL {?event1 addr:hasTime [a addr:TimeInstant; addr:timeCalendar ?timeCalendar1]}\n",
    "    OPTIONAL {?event2 addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValue2]}\n",
    "    OPTIONAL {?event2 addr:hasTime [a addr:TimeInstant; addr:timePrecision ?timePrecision2]}\n",
    "    OPTIONAL {?event2 addr:hasTime [a addr:TimeInstant; addr:timeCalendar ?timeCalendar2]}\n",
    "    FILTER ((?timeValue1 >= ?selectTime && ?timeValue2 <= ?selectTime && ?timeCalendar1 = ?timeCalendar2) ||\n",
    "        (?timeValue1 >= ?selectTime && !BOUND(?timeValue2)) ||\n",
    "        (?timeValue2 <= ?selectTime && !BOUND(?timeValue1))\n",
    "    ) \n",
    "}\n",
    "\"\"\" \n",
    "\n",
    "# Sélection des voies existant à une date donnée avec leur nom d'époque\n",
    "query = \"\"\"\n",
    "PREFIX addr: <http://rdf.geohistoricaldata.org/address#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT ?street ?name ?timeValueStreetCrea ?timeValueStreetDiss WHERE { \n",
    "    BIND(\"1900-01-08T00:00:00\"^^xsd:dateTime AS ?selectTime)\n",
    "\t?street a addr:Landmark; addr:isLandmarkType addr:Thoroughfare; addr:hasAttribute ?attrName.\n",
    "    ?changeStreetDiss addr:dependsOn ?eventStreetDiss; addr:isChangeType addr:LandmarkDissolution; addr:appliedTo ?street.\n",
    "    ?changeStreetCrea addr:dependsOn ?eventStreetCrea; addr:isChangeType addr:LandmarkCreation; addr:appliedTo ?street.\n",
    "    ?eventStreetDiss a addr:Event.\n",
    "    ?eventStreetCrea a addr:Event.\n",
    "    ?attrName a addr:Attribute; addr:isAttributeType addr:NameAttribute; addr:version ?attrNameVersion.\n",
    "    ?attrNameVersion a addr:AttributeVersion; addr:value ?name.\n",
    "    ?change1 addr:before ?attrNameVersion; addr:dependsOn ?event1.\n",
    "    ?change2 addr:after ?attrNameVersion; addr:dependsOn ?event2.\n",
    "    ?event1 a addr:Event.\n",
    "    ?event2 a addr:Event.\n",
    "    OPTIONAL {?event1 addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValue1; addr:timePrecision ?timePrecision1; addr:timeCalendar ?timeCalendar1]}\n",
    "    OPTIONAL {?event2 addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValue2; addr:timePrecision ?timePrecision2; addr:timeCalendar ?timeCalendar2]}\n",
    "    OPTIONAL {?eventStreetDiss addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValueStreetDiss; addr:timePrecision ?timePrecisionStreetDiss; addr:timeCalendar ?timeCalendarStreetDiss]}\n",
    "    OPTIONAL {?eventStreetCrea addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValueStreetCrea; addr:timePrecision ?timePrecisionStreetCrea; addr:timeCalendar ?timeCalendarStreetCrea]}\n",
    "    FILTER ((?timeValue1 >= ?selectTime && ?timeValue2 <= ?selectTime && ?timeCalendar1 = ?timeCalendar2) ||\n",
    "        (?timeValue1 >= ?selectTime && !BOUND(?timeValue2)) ||\n",
    "        (?timeValue2 <= ?selectTime && !BOUND(?timeValue1)) ||\n",
    "        (!BOUND(?timeValue1) && !BOUND(?timeValue2))\n",
    "    ) \n",
    "    FILTER ((?timeValueStreetDiss >= ?selectTime && ?timeValueStreetCrea <= ?selectTime && ?timeCalendarStreetDiss = ?timeCalendarStreetCrea) ||\n",
    "        (?timeValueStreetDiss >= ?selectTime && !BOUND(?timeValueStreetCrea)) ||\n",
    "        (?timeValueStreetCrea <= ?selectTime && !BOUND(?timeValueStreetDiss)) ||\n",
    "        (!BOUND(?timeValueStreetDiss) && !BOUND(?timeValueStreetCrea))\n",
    "    ) \n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Une fois une base de graphe créée, insertion de nouvelles données décrivant des états :\n",
    "* création d'un graphe nommé décrivant l'état du territoire à l'instant donné par `timestamp`\n",
    "* création de liens entre les ressources du graphe nommé et celui qui décrit l'état du territoire au même instant via une source externe."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_queries_for_sources(graph_year_uri, graph_state_uri, timestamp, prefixes):\n",
    "    # Pour chaque voie existant à l'instant défini par le timestamp, création d'une version\n",
    "    query1 = prefixes + f\"\"\"\n",
    "    INSERT {{\n",
    "        GRAPH <{graph_year_uri}> {{\n",
    "        ?version a addr:LandmarkVersion; addr:versionOf ?street.\n",
    "            }}\n",
    "    }}\n",
    "    WHERE {{\n",
    "        GRAPH <{addr_graph_name_uri}> {{\n",
    "            {{\n",
    "                SELECT * WHERE {{\n",
    "                    BIND(\"{timestamp}\"^^xsd:dateTime AS ?selectTime)\n",
    "                    ?street a addr:Landmark; addr:isLandmarkType addr:Thoroughfare.\n",
    "                    ?change1 addr:dependsOn ?event1; addr:isChangeType addr:LandmarkDissolution; addr:appliedTo ?street.\n",
    "                    ?change2 addr:dependsOn ?event2; addr:isChangeType addr:LandmarkCreation; addr:appliedTo ?street.\n",
    "                    ?event1 a addr:Event.\n",
    "                    ?event2 a addr:Event.\n",
    "                    OPTIONAL {{?event1 addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValue1;addr:timePrecision ?timePrecision1; addr:timeCalendar ?timeCalendar1]}}\n",
    "                    OPTIONAL {{?event2 addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValue2; addr:timePrecision ?timePrecision2; addr:timeCalendar ?timeCalendar2]}}\n",
    "                    FILTER ((?timeValue1 >= ?selectTime && ?timeValue2 <= ?selectTime && ?timeCalendar1 = ?timeCalendar2) ||\n",
    "                        (?timeValue1 >= ?selectTime && !BOUND(?timeValue2)) ||\n",
    "                        (?timeValue2 <= ?selectTime && !BOUND(?timeValue1)) ||\n",
    "                        (!BOUND(?timeValue1) && !BOUND(?timeValue2)) \n",
    "                    )\n",
    "                }}\n",
    "            }}\n",
    "        BIND(URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#LMV_\", STRUUID())) AS ?version)\n",
    "        }}\n",
    "    }}\n",
    "    \"\"\" \n",
    "\n",
    "    # Ajout des attributs aux voies valables à l'instant défini\n",
    "    query2 = prefixes + f\"\"\"\n",
    "    INSERT {{\n",
    "        GRAPH <{graph_year_uri}> {{\n",
    "        ?version addr:hasAttribute [addr:isAttributeType ?attrType; addr:value ?attrVersionValue]\n",
    "    }}\n",
    "    }}\n",
    "    WHERE {{\n",
    "        BIND(\"{timestamp}\"^^xsd:dateTime AS ?selectTime)\n",
    "    GRAPH <{graph_year_uri}> {{\n",
    "        ?version a addr:LandmarkVersion; addr:versionOf ?street.\n",
    "    }}\n",
    "    GRAPH <{addr_graph_name_uri}> {{\n",
    "        ?street a addr:Landmark; addr:isLandmarkType addr:Thoroughfare; addr:hasAttribute ?attr.\n",
    "        ?attr addr:isAttributeType ?attrType; addr:version ?attrVersion.\n",
    "            ?attrVersion addr:value ?attrVersionValue.\n",
    "        ?change1 addr:dependsOn ?event1; addr:before ?attrVersion; addr:appliedTo ?attr.\n",
    "        ?change2 addr:dependsOn ?event2; addr:after ?attrVersion; addr:appliedTo ?attr.\n",
    "        ?event1 a addr:Event.\n",
    "        ?event2 a addr:Event.\n",
    "        OPTIONAL {{?event1 addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValue1;addr:timePrecision ?timePrecision1; addr:timeCalendar ?timeCalendar1]}}\n",
    "        OPTIONAL {{?event2 addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValue2; addr:timePrecision ?timePrecision2; addr:timeCalendar ?timeCalendar2]}}\n",
    "        FILTER ((?timeValue1 >= ?selectTime && ?timeValue2 <= ?selectTime && ?timeCalendar1 = ?timeCalendar2) ||\n",
    "            (?timeValue1 >= ?selectTime && !BOUND(?timeValue2)) ||\n",
    "            (?timeValue2 <= ?selectTime && !BOUND(?timeValue1)) ||\n",
    "            (!BOUND(?timeValue1) && !BOUND(?timeValue2)) \n",
    "            )\n",
    "    }}\n",
    "    }}\n",
    "    \"\"\"\n",
    "\n",
    "    replace_function_graph_year = sp.get_lower_simplified_french_street_name_function(\"?streetName\")\n",
    "    replace_function_graph_state = sp.get_lower_simplified_french_street_name_function(\"?streetSourceExtName\")\n",
    "    query3 = prefixes + f\"\"\"\n",
    "    INSERT {{\n",
    "        GRAPH <{graph_year_uri}> {{\n",
    "            ?street owl:sameAs ?streetSourceExt.\n",
    "        }}\n",
    "    }}\n",
    "    WHERE {{\n",
    "        GRAPH <{graph_year_uri}> {{\n",
    "            ?street addr:hasAttribute [addr:isAttributeType addr:NameAttribute; addr:value ?streetName].\n",
    "            BIND({replace_function_graph_year} AS ?streetNameJoin)\n",
    "        }}\n",
    "        GRAPH <{graph_state_uri}> {{\n",
    "            ?streetSourceExt rdfs:label ?streetSourceExtName.\n",
    "            BIND({replace_function_graph_state} AS ?streetSourceExtNameJoin)\n",
    "        }}\n",
    "        FILTER(?streetNameJoin = ?streetSourceExtNameJoin)\n",
    "    }}\n",
    "    \"\"\"\n",
    "\n",
    "    return [query1, query2, query3]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Intégration d'éléments de sources extérieures à Wikidata"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Cette section permet de tester l'ajout des sources externes à Wikidata qui sont hétérogènes qui représentent plusieurs types :\n",
    "* état d'un territoire à un instant donné\n",
    "* événement décrivant des changements sur des entités géographiques"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Création d'un graphe nommé donnant l'état du réseau à un instant donné"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Pour chaque source décrivant l'état du réseau viaire de Paris sur une période donnée (pour l'instant les données sont restreintes au quartier des Arts et Métiers), on a :\n",
    "* un fichier `csv` qui contient les segments des voies, le nom des segments (nom de la voie), un identifant ;\n",
    "* un fichier `json` de mapping qui va convertir le fichier précédent en un graphe de connaissances selon les modalités fixées ;\n",
    "* le nom du graphe nommé dans lequel sera stocké le graphe créé par le fichier de mapping via le fichier `csv` ;\n",
    "* une date qui décrit un instant de validité de la source."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "# ontorefine_cmd = \"ontorefine-cli\"\n",
    "ontorefine_cmd = \"/opt/ontotext-refine/lib/app/bin/ontorefine-cli\"\n",
    "# ontorefine_cmd = \"/Applications/Ontotext\\ Refine.app/Contents/app/bin/ontorefine-cli\"\n",
    "ontorefine_url = \"http://localhost:7333\"\n",
    "\n",
    "sources = [\n",
    "    {\"filename\": \"andriveau_1849_am.csv\", \"mapping_file\":\"mapping_andriveau_1849_am.json\",\"graphname\":\"andriveau1849\", \"date\":\"1849-01-01\"},\n",
    "    {\"filename\": \"atlas_municipal_1888_am.csv\", \"mapping_file\":\"mapping_atlas_municipal_1888_am.json\",\"graphname\":\"atlasMunicipal1888\", \"date\":\"1888-01-01\"},\n",
    "    {\"filename\": \"piquet_1826_am.csv\", \"mapping_file\":\"mapping_piquet_1826_am.json\",\"graphname\":\"piquet1826\", \"date\":\"1826-01-01\"},\n",
    "    {\"filename\": \"verniquet_1791_am.csv\", \"mapping_file\":\"mapping_verniquet_1791_am.json\",\"graphname\":\"verniquet1791\", \"date\":\"1791-01-01\"},\n",
    "]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Pour chaque source, on fait les traitements suivants :\n",
    "* conversion du fichier `csv` en un graphe de connaissances via le fichier de mapping grâce à l'invite de commandes d'Ontotext Refine, le fichier de sortie est un fichier `ttl` décrit par la variable `export_file` ;\n",
    "* afin de pouvoir faire des comparaisons de noms de rues, un traitement est opéré sur les noms pour avoir une normalisation. Par exemple, *pl. de la République* devient \"place de la République* ;\n",
    "* import du fichier `ttl` dans GraphDB dans le graphe nommé défini par `graph_name`\n",
    "* création d'un graphe nommé `graph_state` dans lequel sont représentées des versions du réseau viaire à la date fixée, il donne l'état du réseau viaire à cette date. Pour chaque voie existant à la date t (selon le graphe), on lui associe une version : `<?versionVoie addr:versionOf ?voie>` (#TODO: expliciter le lien temporel entre `?versionVoie` et `?voie`)\n",
    "* en fonction d'un ou plusieurs critères (notamment le nom), création de liens entre les éléments du graphe `graph_name` et ceux de `graph_state`.\n",
    "\n",
    "Ainsi, pour chaque élément de la source, on l'aura associé (ou pas) à une version d'une voie."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "  0     0    0     0    0     0      0      0 --:--:--  0:00:01 --:--:--     0\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "  0     0    0     0    0     0      0      0 --:--:--  0:00:01 --:--:--     0\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Successfully deleted project with identifier: 2411582997316\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  102k    0     0  100  102k      0   991k --:--:-- --:--:-- --:--:--  988k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  6866    0     0  100  6866      0   7603 --:--:-- --:--:-- --:--:--  7595\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  6483    0     0  100  6483      0  10998 --:--:-- --:--:-- --:--:-- 11006\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  6691    0     0  100  6691      0    478  0:00:13  0:00:13 --:--:--     0\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "  0     0    0     0    0     0      0      0 --:--:--  0:00:01 --:--:--     0\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "  0     0    0     0    0     0      0      0 --:--:--  0:00:02 --:--:--     0\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Successfully deleted project with identifier: 2182045330416\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  111k    0     0  100  111k      0  1328k --:--:-- --:--:-- --:--:-- 1330k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  6866    0     0  100  6866      0   8370 --:--:-- --:--:-- --:--:--  8362\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  6483    0     0  100  6483      0  10981 --:--:-- --:--:-- --:--:-- 10969\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  6696    0     0  100  6696      0    276  0:00:24  0:00:24 --:--:--     0\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "  0     0    0     0    0     0      0      0 --:--:--  0:00:01 --:--:--     0\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "  0     0    0     0    0     0      0      0 --:--:--  0:00:01 --:--:--     0\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Successfully deleted project with identifier: 2671515618248\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 82314    0     0  100 82314      0  1035k --:--:-- --:--:-- --:--:-- 1030k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  6866    0     0  100  6866      0   9103 --:--:-- --:--:-- --:--:--  9106\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  6483    0     0  100  6483      0  12663 --:--:-- --:--:-- --:--:-- 12686\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  6688    0     0  100  6688      0   1785  0:00:03  0:00:03 --:--:--  1784\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "  0     0    0     0    0     0      0      0 --:--:--  0:00:01 --:--:--     0\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "  0     0    0     0    0     0      0      0 --:--:--  0:00:01 --:--:--     0\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Successfully deleted project with identifier: 2378248066715\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 73032    0     0  100 73032      0   969k --:--:-- --:--:-- --:--:--  976k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  6866    0     0  100  6866      0   9517 --:--:-- --:--:-- --:--:--  9522\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  6483    0     0  100  6483      0  13464 --:--:-- --:--:-- --:--:-- 13450\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  6691    0     0  100  6691      0    650  0:00:10  0:00:10 --:--:--     0\n"
     ]
    }
   ],
   "source": [
    "for source in sources:\n",
    "    source_file = os.path.join(source_folder, source.get(\"filename\"))\n",
    "    mapping_file = os.path.join(mapping_folder, source.get(\"mapping_file\"))\n",
    "    export_file = os.path.join(tmp_folder, source.get(\"filename\").replace(\".csv\", \".ttl\"))\n",
    "    graph_name = source.get(\"graphname\")\n",
    "    date = source.get(\"date\")\n",
    "    timestamp = f\"{date}T00:00:00\"\n",
    "\n",
    "    graph_year_name = f\"local_street_{date}\"\n",
    "    graph_year_uri = gd.get_graph_uri_from_name(graphdb_url, project_name, graph_year_name)\n",
    "    graph_state_uri = gd.get_graph_uri_from_name(graphdb_url, project_name, graph_name)\n",
    "\n",
    "    gd.remove_graph(graphdb_url, project_name, graph_name)\n",
    "    gd.remove_graph(graphdb_url, project_name, graph_year_name)\n",
    "    otr.get_export_file_from_ontorefine(source_file, mapping_file, export_file, ontorefine_cmd, ontorefine_url, project_name)\n",
    "    sp.normalize_street_rdfs_labels_in_graph_file(export_file)\n",
    "    gd.import_ttl_file_in_graphdb(graphdb_url, project_name, export_file, graph_name)\n",
    "\n",
    "    queries = get_queries_for_sources(graph_year_uri, graph_state_uri, timestamp, prefixes)\n",
    "    for query in queries:\n",
    "        gd.update_query(query, graphdb_url, project_name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Insertion d'événements dans le graphe"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Ajout de l'événement suivant cité comme ceci dans le Wikipedia français (https://fr.wikipedia.org/wiki/Rue_Pastourelle) :\n",
    ">*[la rue Pastourelle] est la réunion, depuis 1877, de deux rues situées de part et d'autre de la rue des Archives :<br>\n",
    ">la « rue Groignet » ouverte en 1296 [...], et de<br>\n",
    ">la « rue d'Anjou » ou « rue d'Anjou au Marais » ouverte en 1626 [...].*\n",
    "\n",
    "Les étapes pour créer cet événément :\n",
    "* **sélection des entités** géographiques citées (en fonction du nom qu'elles possédaient à l'instant de l'événément) ;\n",
    "* **création des entités** qui n'existent pas ;\n",
    "* détection de l'événement décrit ci-dessus pour voir s'il existe déjà ;\n",
    "* **création de l'événement en l'associant à une valeur temporelle**, il est le résultat de la fusion des événements associés aux changements élémentaires (si A et B fusionnent en C, l'événement va fusionner les événements liés aux dissolutions de A et B et de la création de C qui n'ont normalement pas d'entité temporelle)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Définition de variables globales du traitement"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "timestamp = \"1877-01-01T00:00:00\"\n",
    "time_precision = \"year\"\n",
    "time_calendar = \"wd:Q1985727\"\n",
    "street_name = \"rue Pastourelle\"\n",
    "lang = \"fr\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Détection des entités dans le graphe"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 11125    0   113  100 11012    773  75370 --:--:-- --:--:-- --:--:-- 75680\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 11126    0   113  100 11013    682  66495 --:--:-- --:--:-- --:--:-- 67430\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 11144    0   113  100 11031    821  80196 --:--:-- --:--:-- --:--:-- 81343\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 11418    0   415  100 11003   2697  71516 --:--:-- --:--:-- --:--:-- 74627\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "  0     0    0     0    0     0      0      0 --:--:--  0:00:01 --:--:--     0\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  5011    0     0  100  5011      0  75950 --:--:-- --:--:-- --:--:-- 77092\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  6360    0     0  100  6360      0  84697 --:--:-- --:--:-- --:--:-- 84800\n"
     ]
    }
   ],
   "source": [
    "def get_street_in_time_from_name(street_name, timestamp:Literal, time_precision:URIRef, time_calendar:URIRef, prefixes, lang=\"fr\"):\n",
    "    val_tRef = \"?timeValueRef\"\n",
    "    cal_tRef = \"?timeCalRef\"\n",
    "    cal_t1 = \"?timeCal1\"\n",
    "    val_t1 = \"?timeValue1\"\n",
    "    cal_t2 = \"?timeCal2\"\n",
    "    val_t2 = \"?timeValue2\"\n",
    "    attr_cal_t1 = \"?timeCalAttr1\"\n",
    "    attr_val_t1 = \"?timeValueAttr1\"\n",
    "    attr_cal_t2 = \"?timeCalAttr2\"\n",
    "    attr_val_t2 = \"?timeValueAttr2\"\n",
    "    street_var = \"street\"\n",
    "    street_name_var = \"street_name\"\n",
    "    label_var = \"label\"\n",
    "    simplified_label_var = \"simplified_label\"\n",
    "    simplified_street_name_var = \"simplified_street_name\"\n",
    "\n",
    "    time_filter_st = sp.define_time_filter_for_sparql_query(val_tRef, cal_tRef, val_t1, cal_t1, val_t2, cal_t2, time_precision)\n",
    "    time_filter_attr = sp.define_time_filter_for_sparql_query(val_tRef, cal_tRef, attr_val_t1, attr_cal_t1, attr_val_t2, attr_cal_t2, time_precision)\n",
    "    simplified_street_name = sp.get_lower_simplified_french_street_name_function(f\"?{street_name_var}\")\n",
    "    simplified_label = sp.get_lower_simplified_french_street_name_function(f\"?{label_var}\")\n",
    "    street_name_lit = Literal(street_name, lang=lang)\n",
    "    query = prefixes + f\"\"\"\n",
    "    SELECT ?{street_var} ?{label_var}\n",
    "    WHERE {{\n",
    "        BIND({timestamp.n3()} AS {val_tRef})\n",
    "        BIND({time_calendar.n3()} AS {cal_tRef})\n",
    "        BIND({street_name_lit.n3()} AS ?{label_var})\n",
    "        BIND({simplified_label} AS ?{simplified_label_var})\n",
    "        BIND(addr:Thoroughfare AS ?landmarkType)\n",
    "        GRAPH <{addr_graph_name_uri}> {{\n",
    "            ?{street_var} a addr:Landmark ; addr:isLandmarkType ?landmarkType.\n",
    "            ?changeSt1 addr:dependsOn ?eventSt1; addr:isChangeType addr:LandmarkDissolution; addr:appliedTo ?{street_var}.\n",
    "            ?changeSt2 addr:dependsOn ?eventSt2; addr:isChangeType addr:LandmarkCreation; addr:appliedTo ?{street_var}.\n",
    "            ?eventSt1 a addr:Event.\n",
    "            ?eventSt2 a addr:Event.\n",
    "            OPTIONAL {{?eventSt1 addr:hasTime [a addr:TimeInstant; addr:timeStamp {val_t1}; addr:timePrecision ?timePrecision1; addr:timeCalendar {cal_t1}]}}\n",
    "            OPTIONAL {{?eventSt2 addr:hasTime [a addr:TimeInstant; addr:timeStamp {val_t2}; addr:timePrecision ?timePrecision2; addr:timeCalendar {cal_t2}]}}\n",
    "            {time_filter_st}\n",
    "            ?{street_var} addr:hasAttribute ?attrName.\n",
    "            ?attrName a addr:Attribute; addr:isAttributeType addr:NameAttribute; addr:version ?attrNameVersion.\n",
    "            ?attrNameVersion a addr:AttributeVersion; addr:value ?{street_name_var}.\n",
    "            BIND({simplified_street_name} AS ?{simplified_street_name_var})\n",
    "            ?changeAttr1 addr:before ?attrNameVersion; addr:dependsOn ?eventAttr1.\n",
    "            ?changeAttr2 addr:after ?attrNameVersion; addr:dependsOn ?eventAttr2.\n",
    "            ?eventAttr1 a addr:Event.\n",
    "            ?eventAttr2 a addr:Event.\n",
    "            OPTIONAL {{?eventAttr1 addr:hasTime [a addr:TimeInstant; addr:timeStamp {attr_val_t1}; addr:timePrecision ?timePrecisionAttr1; addr:timeCalendar {attr_cal_t1}]}}\n",
    "            OPTIONAL {{?eventAttr2 addr:hasTime [a addr:TimeInstant; addr:timeStamp {attr_val_t2}; addr:timePrecision ?timePrecisionAttr2; addr:timeCalendar {attr_cal_t2}]}}\n",
    "            {time_filter_attr}\n",
    "            FILTER(?{simplified_street_name_var} = ?{simplified_label_var})\n",
    "    }}\n",
    "    }}\n",
    "    \"\"\"\n",
    "\n",
    "    results = gd.select_query_to_json(query, graphdb_url, project_name)\n",
    "    streets = []\n",
    "\n",
    "    for binding in results.get(\"results\").get(\"bindings\"):\n",
    "        result_elem = binding.get(street_var)\n",
    "        street = gr.convert_result_elem_to_rdflib_elem(result_elem)\n",
    "        streets.append(street)\n",
    "\n",
    "    return streets\n",
    "\n",
    "def create_basic_street_with_name(landmark_uri:URIRef, street_name:str, g, lang:str=\"fr\"):\n",
    "    attribute_uri = gr.generate_uri(namespace, \"ATTR\")\n",
    "    gr.create_landmark_with_changes(landmark_uri, street_name, lang, \"Thoroughfare\", g, namespace)\n",
    "    gr.create_landmark_attribute(attribute_uri, landmark_uri, \"NameAttribute\", g, namespace)\n",
    "    gr.create_attribute_version(attribute_uri, street_name, g, namespace, lang)\n",
    "\n",
    "def get_sparql_triples_to_get_landmark_change(landmark_uri:URIRef, change_type_uri:URIRef):\n",
    "    random_variable = f\"?{gr.generate_uuid()}\"\n",
    "    return f\"{random_variable} a addr:Change; addr:dependsOn ?event; addr:isChangeType {change_type_uri.n3()}; addr:appliedTo {landmark_uri.n3()}\"\n",
    "\n",
    "def get_sparql_query_to_merge_events(event_landmarks:list, time_stamp:Literal, time_calendar:URIRef, time_precision:URIRef):\n",
    "    \"\"\"\n",
    "    `event_landmarks` is a list of dictionaries. Each dictionary must contain a URI of a landmark and the type of change related to the event :\n",
    "    `{\"uri\":URIRef('http://www.example.org/landmark'), \"change_type\":URIRef('http://www.example.org/Creation')}` \n",
    "    \"\"\"\n",
    "\n",
    "    changes_list = []\n",
    "    for event_lm in event_landmarks:\n",
    "        line = get_sparql_triples_to_get_landmark_change(event_lm.get(\"uri\"), event_lm.get(\"change_type\"))\n",
    "        changes_list.append(f\"{{ {line} }}\")\n",
    "    \n",
    "    changes = \"UNION\".join(changes_list)\n",
    "\n",
    "    query = prefixes + f\"\"\"\n",
    "    DELETE {{\n",
    "        ?s ?p ?event.\n",
    "        ?event ?p ?o.\n",
    "    }}\n",
    "    INSERT {{\n",
    "        ?s ?p ?mergedEvent.\n",
    "        ?mergedEvent ?p ?o.\n",
    "        ?mergedEvent addr:hasTime ?temporalEntity.\n",
    "        ?temporalEntity a addr:TimeInstant; addr:timeCalendar {time_calendar.n3()}; addr:timePrecision {time_precision.n3()}; addr:timeStamp {time_stamp.n3()}\n",
    "    }}\n",
    "    WHERE {{\n",
    "        {{SELECT * WHERE {{\n",
    "        BIND(URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#EV_\", STRUUID())) AS ?mergedEvent)\n",
    "        BIND(URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#TE_\", STRUUID())) AS ?temporalEntity)\n",
    "            }} }}\n",
    "        {changes}\n",
    "        {{?s ?p ?event }} UNION {{?event ?p ?o }}\n",
    "    }}\n",
    "    \"\"\"\n",
    "\n",
    "    return query\n",
    "\n",
    "g = Graph()\n",
    "namespace = Namespace(local_uri)\n",
    "owl_time_ns = Namespace(\"http://www.w3.org/2006/time#\")\n",
    "wd_ns = Namespace(\"http://www.wikidata.org/entity/\")\n",
    "\n",
    "test_graph_name = \"test\"\n",
    "test_file_name = \"test.ttl\"\n",
    "test_file = os.path.join(tmp_folder, test_file_name)\n",
    "\n",
    "event_description = {\"time\":\n",
    "                     {\"stamp\":Literal(\"1877-01-01T00:00:00\",datatype=XSD.dateTime),\n",
    "                      \"precision\":owl_time_ns[\"unitYear\"],\n",
    "                      \"calendar\":wd_ns[\"Q1985727\"]},\n",
    "                     \"lang\":\"fr\",\n",
    "                     \"landmarks\":[\n",
    "                         {\"name\":\"rue d'Anjou\", \"change_type\":\"LandmarkDissolution\", \"landmark_type\":\"Thoroughfare\"},\n",
    "                         {\"name\":\"rue Groignet\", \"change_type\":\"LandmarkDissolution\", \"landmark_type\":\"Thoroughfare\"},\n",
    "                         {\"name\":\"rue Pastourelle\", \"change_type\":\"LandmarkCreation\", \"landmark_type\":\"Thoroughfare\"}\n",
    "                         ]\n",
    "                         }\n",
    "\n",
    "\n",
    "event_description = {\"time\":\n",
    "                     {\"stamp\":Literal(\"1851-02-18T00:00:00\",datatype=XSD.dateTime),\n",
    "                      \"precision\":owl_time_ns[\"unitDay\"],\n",
    "                      \"calendar\":wd_ns[\"Q1985727\"]},\n",
    "                     \"lang\":\"fr\",\n",
    "                     \"landmarks\":[\n",
    "                         {\"name\":\"rue Frépillon\", \"change_type\":\"LandmarkDissolution\", \"landmark_type\":\"Thoroughfare\"},\n",
    "                         {\"name\":\"rue de la Croix\", \"change_type\":\"LandmarkDissolution\", \"landmark_type\":\"Thoroughfare\"},\n",
    "                         {\"name\":\"rue du Pont-aux-Biches-Saint-Martin\", \"change_type\":\"LandmarkDissolution\", \"landmark_type\":\"Thoroughfare\"},\n",
    "                         {\"name\":\"rue Volta\", \"change_type\":\"LandmarkCreation\", \"landmark_type\":\"Thoroughfare\"}\n",
    "                         ]\n",
    "                         }\n",
    "\n",
    "\n",
    "timestamp = event_description.get(\"time\").get(\"stamp\")\n",
    "time_precision = event_description.get(\"time\").get(\"precision\")\n",
    "time_calendar = event_description.get(\"time\").get(\"calendar\")\n",
    "for landmark in event_description.get(\"landmarks\"):\n",
    "    street_name = landmark.get(\"name\")\n",
    "    streets = get_street_in_time_from_name(street_name, timestamp, time_precision, time_calendar, prefixes)\n",
    "\n",
    "    if streets == []:\n",
    "        landmark_uri = gr.generate_uri(namespace, \"LM\")\n",
    "        landmark[\"uri\"] = landmark_uri\n",
    "        create_basic_street_with_name(landmark_uri, street_name, g)\n",
    "    else:\n",
    "        landmark[\"uri\"] = streets[0]\n",
    "\n",
    "    landmark[\"change_type\"] = namespace[landmark.get(\"change_type\")]\n",
    "\n",
    "g.serialize(test_file)\n",
    "gd.remove_graph(graphdb_url, project_name, test_graph_name)\n",
    "gd.import_ttl_file_in_graphdb(graphdb_url, project_name, test_file, test_graph_name)\n",
    "time_stamp = Literal(timestamp, datatype=XSD.dateTime)\n",
    "time_calendar = URIRef(time_calendar)\n",
    "time_precision = URIRef(time_precision)                   \n",
    "query = get_sparql_query_to_merge_events(event_description.get(\"landmarks\"), time_stamp, time_calendar, time_precision)\n",
    "gd.update_query(query, graphdb_url, project_name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Ajout d'une validité temporelle pour l'appartenance aux arrondissements et aux quartiers administratifs (début : 16 juin 1859)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PREFIX agg: <http://jena.apache.org/ARQ/function/aggregate#>\n",
      "PREFIX : <http://rdf.geohistoricaldata.org/address#>\n",
      "PREFIX pq: <http://www.wikidata.org/prop/qualifier/>\n",
      "PREFIX pr: <http://www.wikidata.org/prop/reference/>\n",
      "PREFIX ps: <http://www.wikidata.org/prop/statement/>\n",
      "PREFIX data: <https://www.wikidata.org/wiki/Special:EntityData/>\n",
      "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
      "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\n",
      "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
      "PREFIX pqn: <http://www.wikidata.org/prop/qualifier/value-normalized/>\n",
      "PREFIX ns1: <http://rdf.geohistoricaldata.org/address#>\n",
      "PREFIX spif: <http://spinrdf.org/spif#>\n",
      "PREFIX path: <http://www.ontotext.com/path#>\n",
      "PREFIX ref: <http://www.wikidata.org/reference/>\n",
      "PREFIX pqv: <http://www.wikidata.org/prop/qualifier/value/>\n",
      "PREFIX apf: <http://jena.apache.org/ARQ/property#>\n",
      "PREFIX xml: <http://www.w3.org/XML/1998/namespace>\n",
      "PREFIX rep: <http://www.openrdf.org/config/repository#>\n",
      "PREFIX wgs: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
      "PREFIX wikibase: <http://wikiba.se/ontology#>\n",
      "PREFIX list: <http://jena.apache.org/ARQ/list#>\n",
      "PREFIX prn: <http://www.wikidata.org/prop/reference/value-normalized/>\n",
      "PREFIX wdtn: <http://www.wikidata.org/prop/direct-normalized/>\n",
      "PREFIX prv: <http://www.wikidata.org/prop/reference/value/>\n",
      "PREFIX geoext: <http://rdf.useekm.com/ext#>\n",
      "PREFIX math: <http://www.w3.org/2005/xpath-functions/math>\n",
      "PREFIX schema: <http://schema.org/>\n",
      "PREFIX sail: <http://www.openrdf.org/config/sail#>\n",
      "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
      "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "PREFIX fn: <http://www.w3.org/2005/xpath-functions>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX psn: <http://www.wikidata.org/prop/statement/value-normalized/>\n",
      "PREFIX wd: <http://www.wikidata.org/entity/>\n",
      "PREFIX geo: <http://www.opengis.net/ont/geosparql#>\n",
      "PREFIX psv: <http://www.wikidata.org/prop/statement/value/>\n",
      "PREFIX dct: <http://purl.org/dc/terms/>\n",
      "PREFIX array: <http://www.w3.org/2005/xpath-functions/array>\n",
      "PREFIX ontolex: <http://www.w3.org/ns/lemon/ontolex#>\n",
      "PREFIX addr: <http://rdf.geohistoricaldata.org/address#>\n",
      "PREFIX map: <http://www.w3.org/2005/xpath-functions/map>\n",
      "PREFIX prov: <http://www.w3.org/ns/prov#>\n",
      "PREFIX sr: <http://www.openrdf.org/config/repository/sail#>\n",
      "PREFIX cc: <http://creativecommons.org/ns#>\n",
      "PREFIX gn: <http://www.geonames.org/ontology#>\n",
      "PREFIX afn: <http://jena.apache.org/ARQ/function#>\n",
      "PREFIX p: <http://www.wikidata.org/prop/>\n",
      "PREFIX s: <http://www.wikidata.org/entity/statement/>\n",
      "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
      "PREFIX schema1: <http://schema.org/>\n",
      "PREFIX ofn: <http://www.ontotext.com/sparql/functions/>\n",
      "PREFIX v: <http://www.wikidata.org/value/>\n",
      "PREFIX graphdb: <http://www.ontotext.com/config/graphdb#>\n",
      "PREFIX wdno: <http://www.wikidata.org/prop/novalue/>\n",
      "PREFIX time: <http://www.w3.org/2006/time#>\n",
      "PREFIX omgeo: <http://www.ontotext.com/owlim/geo#>\n",
      "\n",
      "DELETE {\n",
      "    ?s ?p ?changeEvent.\n",
      "    ?changeEvent ?p ?o.\n",
      "}\n",
      "INSERT {\n",
      "    ?s ?p ?event.\n",
      "    ?event ?p ?o.\n",
      "    ?event a addr:Event; addr:hasTime ?timeInstant.\n",
      "    ?timeInstant a addr:TimeInstant; addr:timeStamp \"1859-06-16T00:00:00\"^^<http://www.w3.org/2001/XMLSchema#dateTime>; addr:timePrecision time:unitDay; addr:timeCalendar <http://www.wikidata.org/entity/Q1985727>.\n",
      "}\n",
      "WHERE {\n",
      "    ?lmr a addr:LandmarkRelation;\n",
      "         addr:isLandmarkRelationType addr:Within;\n",
      "         addr:relatum [a addr:Landmark; addr:isLandmarkType addr:District].\n",
      "    ?change a addr:Change ; addr:isChangeType addr:RelationCreation ; addr:appliedTo ?lmr; addr:dependsOn ?changeEvent.\n",
      "    {\n",
      "        SELECT * WHERE {\n",
      "            BIND(URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#EV_\", STRUUID())) AS ?event)\n",
      "            BIND(URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#TI_\", STRUUID())) AS ?timeInstant)\n",
      "        }\n",
      "    }\n",
      "    {?s ?p ?changeEvent}UNION{?changeEvent ?p ?o}\n",
      "}\n",
      "\n"
     ]
    }
   ],
   "source": [
    "time_stamp = Literal(\"1859-06-16T00:00:00\",datatype=XSD.dateTime)\n",
    "\n",
    "query = prefixes + f\"\"\"\n",
    "DELETE {{\n",
    "    ?s ?p ?changeEvent.\n",
    "    ?changeEvent ?p ?o.\n",
    "}}\n",
    "INSERT {{\n",
    "    ?s ?p ?event.\n",
    "    ?event ?p ?o.\n",
    "    ?event a addr:Event; addr:hasTime ?timeInstant.\n",
    "    ?timeInstant a addr:TimeInstant; addr:timeStamp {time_stamp.n3()}; addr:timePrecision time:unitDay; addr:timeCalendar {time_calendar.n3()}.\n",
    "}}\n",
    "WHERE {{\n",
    "    ?lmr a addr:LandmarkRelation;\n",
    "         addr:isLandmarkRelationType addr:Within;\n",
    "         addr:relatum [a addr:Landmark; addr:isLandmarkType addr:District].\n",
    "    ?change a addr:Change ; addr:isChangeType addr:RelationCreation ; addr:appliedTo ?lmr; addr:dependsOn ?changeEvent.\n",
    "    {{\n",
    "        SELECT * WHERE {{\n",
    "            BIND(URI(CONCAT(\"{local_uri}EV_\", STRUUID())) AS ?event)\n",
    "            BIND(URI(CONCAT(\"{local_uri}TI_\", STRUUID())) AS ?timeInstant)\n",
    "        }}\n",
    "    }}\n",
    "    {{?s ?p ?changeEvent}}UNION{{?changeEvent ?p ?o}}\n",
    "}}\n",
    "\"\"\"\n",
    "print(query)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.12"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
