{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Variables"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import des librairies"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from rdflib import Graph\n",
    "import code.filemanagement as fm\n",
    "import code.wikidata as wd\n",
    "import code.ontorefine as otr\n",
    "import code.graphdb as gd"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Définition des variables globales"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Fichiers existants\n",
    "addr_ont_file_name = \"address_ont.ttl\"\n",
    "ev_ont_file_name = \"events_ont.ttl\"\n",
    "\n",
    "# Fichiers créés durant le processus\n",
    "export_file_name = \"addresses-temp.ttl\"\n",
    "out_file_name = \"addresses.ttl\"\n",
    "local_config_file_name = \"config_repo.ttl\"\n",
    "\n",
    "tmp_folder_name = \"tmp_files\"\n",
    "source_folder_name = \"sources\"\n",
    "mapping_folder_name = \"mappings\"\n",
    "wikidata_folder_name = \"wikidata\"\n",
    "\n",
    "project_name = \"voies_paris_hist\" \n",
    "graphdb_url = \"http://localhost:7200\"\n",
    "\n",
    "wd_graph_name = \"wikidata\"\n",
    "addr_graph_name = \"local_street\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Traitement des variables globales\n",
    "\n",
    "* Obtention des chemins absolus des fichiers à partir des chemins relatifs donnés dans la section précédente\n",
    "* Création d'un dossier temporaire s'il n'existe pas encore pour stocker des fichiers à vocation d'être supprimés"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "tmp_folder = os.path.abspath(tmp_folder_name)\n",
    "wikidata_folder = os.path.join(tmp_folder, wikidata_folder_name)\n",
    "source_folder = os.path.abspath(source_folder_name)\n",
    "mapping_folder = os.path.abspath(mapping_folder_name)\n",
    "\n",
    "fm.create_folder_if_not_exists(tmp_folder)\n",
    "fm.create_folder_if_not_exists(wikidata_folder)\n",
    "\n",
    "local_config_file = os.path.join(tmp_folder, local_config_file_name)\n",
    "addr_ont_file = os.path.abspath(addr_ont_file_name)\n",
    "ev_ont_file = os.path.abspath(ev_ont_file_name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Gestion du répertoire local"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Création du répertoire local dans GraphDB\n",
    "Pour que la création marche, il faut que GraphDB soit lancé et donc que l'URI donné par `graphdb_url` fonctionne. Si le répertoire existe déjà, rien n'est fait"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{\"message\":\"Repository voies_paris_hist already exists.\"}"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  1649    0    57  100  1592   1773  49540 --:--:-- --:--:-- --:--:-- 68708\n"
     ]
    }
   ],
   "source": [
    "gd.create_config_local_repository_file(local_config_file, project_name)\n",
    "gd.create_repository_from_config_file(graphdb_url, local_config_file)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Vidage du répertoire local\n",
    "Le répertoire dont l'id est `project_name` pour y stocker les données récupérées, cela est utile si le répertoire existait déjà."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0\n"
     ]
    }
   ],
   "source": [
    "gd.clear_repository(graphdb_url, project_name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import des ontologies"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 19366    0     0  100 19366      0  70695 --:--:-- --:--:-- --:--:-- 72531\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 12901    0     0  100 12901      0  52494 --:--:-- --:--:-- --:--:-- 53754\n"
     ]
    }
   ],
   "source": [
    "gd.import_ttl_file_in_graphdb(graphdb_url, project_name, addr_ont_file)\n",
    "gd.import_ttl_file_in_graphdb(graphdb_url, project_name, ev_ont_file)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Import des données de Wikidata\n",
    "Récupération des fichiers ttl d'éléments de Wikidata (voies, quartiers, arrondissements de Paris). Ensuite ces fichiers sont importés dans le répertoire local."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Récupération des éléments de Wikidata\n",
    "Pour chaque élément Wikidata décrivant une rue de Paris, on extrait un fichier `ttl` le décrivant.\n",
    "Ce processus peut prendre du temps (environ 1 heure et demie) du fait du nombre d'éléments à récupérer (presque 7000)."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Création des requêtes\n",
    "Création des requêtes pour récupérer les données liées aux voies de Paris et une autre pour avoir les zones de la ville (quartiers administratifs et arrondissements)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "qid_variable = \"qid\"\n",
    "\n",
    "query_streets = f\"\"\"\n",
    "SELECT DISTINCT ?{qid_variable}\n",
    "WHERE {{\n",
    "{{?{qid_variable} p:P361 [ps:P361 wd:Q16024163].}}\n",
    "UNION\n",
    "{{?{qid_variable} p:P361 [ps:P361 wd:Q107311481].}}\n",
    "}}\n",
    "ORDER BY ?{qid_variable}\n",
    "\"\"\"\n",
    "\n",
    "query_areas = f\"\"\"\n",
    "SELECT DISTINCT ?qid WHERE {{\n",
    "  {{BIND (wd:Q90 AS ?{qid_variable}) }}\n",
    "  UNION{{?{qid_variable} p:P31 [ps:P31 wd:Q252916].}}\n",
    "  UNION{{?{qid_variable} p:P31 [ps:P31 wd:Q702842]; p:P131 [ps:P131 wd:Q90].}}\n",
    "}}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Lancement des requêtes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "# # Décommenter ces lignes pour récupérer les données\n",
    "\n",
    "# # Récupération des voies de Paris\n",
    "# wd.get_ttl_files_from_wikidata_query(query_streets, qid_variable, wikidata_folder, flavor=\"dump\")\n",
    "\n",
    "# #Récupération des zones de Paris\n",
    "wd.get_ttl_files_from_wikidata_query(query_areas, qid_variable, wikidata_folder, flavor=\"dump\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import des fichiers `ttl` venant de Wikidata\n",
    "Importer tous les fichiers ttl dans un graphe nommé défini par `wd_graph_name` dans le répertoire (une vingtaine de minutes pour 7000 fichiers)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100 12759    0     0  100 12759      0  71335 --:--:-- --:--:-- --:--:-- 73751\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13237    0     0  100 13237      0  24245 --:--:-- --:--:-- --:--:-- 24467\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 12078    0     0  100 12078      0  65003 --:--:-- --:--:-- --:--:-- 67100\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  8345    0     0  100  8345      0  44177 --:--:-- --:--:-- --:--:-- 46620\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 11897    0     0  100 11897      0  60084 --:--:-- --:--:-- --:--:-- 61642\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  9653    0     0  100  9653      0  50027 --:--:-- --:--:-- --:--:-- 51345\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 11355    0     0  100 11355      0  55184 --:--:-- --:--:-- --:--:-- 56775\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13045    0     0  100 13045      0  63265 --:--:-- --:--:-- --:--:-- 64900\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13741    0     0  100 13741      0  66991 --:--:-- --:--:-- --:--:-- 69751\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 16071    0     0  100 16071      0  84587 --:--:-- --:--:-- --:--:-- 86403\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14303    0     0  100 14303      0  69460 --:--:-- --:--:-- --:--:-- 71515\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  9703    0     0  100  9703      0  53494 --:--:-- --:--:-- --:--:-- 55764\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 16764    0     0  100 16764      0  37635 --:--:-- --:--:-- --:--:-- 38100\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 11850    0     0  100 11850      0  57037 --:--:-- --:--:-- --:--:-- 58955\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13197    0     0  100 13197      0  83079 --:--:-- --:--:-- --:--:-- 86254\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  7567    0     0  100  7567      0  45209 --:--:-- --:--:-- --:--:-- 47293\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13908    0     0  100 13908      0  88007 --:--:-- --:--:-- --:--:-- 92105\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 11674    0     0  100 11674      0  76577 --:--:-- --:--:-- --:--:-- 80510\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13076    0     0  100 13076      0  52995 --:--:-- --:--:-- --:--:-- 54711\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14268    0     0  100 14268      0  92374 --:--:-- --:--:-- --:--:-- 97061\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 11401    0     0  100 11401      0  74192 --:--:-- --:--:-- --:--:-- 77557\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 11577    0     0  100 11577      0  74533 --:--:-- --:--:-- --:--:-- 78755\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14285    0     0  100 14285      0  95547 --:--:-- --:--:-- --:--:-- 99201\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 12114    0     0  100 12114      0  68577 --:--:-- --:--:-- --:--:-- 70430\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13876    0     0  100 13876      0  92543 --:--:-- --:--:-- --:--:-- 96361\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 11217    0     0  100 11217      0  77711 --:--:-- --:--:-- --:--:-- 80697\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14179    0     0  100 14179      0  97019 --:--:-- --:--:-- --:--:--   98k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13146    0     0  100 13146      0  75613 --:--:-- --:--:-- --:--:-- 82679\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 17511    0     0  100 17511      0   116k --:--:-- --:--:-- --:--:--  120k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13188    0     0  100 13188      0  92581 --:--:-- --:--:-- --:--:-- 95565\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13340    0     0  100 13340      0  90261 --:--:-- --:--:-- --:--:-- 93943\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 15570    0     0  100 15570      0   103k --:--:-- --:--:-- --:--:--  107k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 16768    0     0  100 16768      0   110k --:--:-- --:--:-- --:--:--  116k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 12696    0     0  100 12696      0  78785 --:--:-- --:--:-- --:--:-- 81384\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 16969    0     0  100 16969      0   114k --:--:-- --:--:-- --:--:--  118k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13649    0     0  100 13649      0  93528 --:--:-- --:--:-- --:--:-- 96801\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 12678    0     0  100 12678      0  80886 --:--:-- --:--:-- --:--:-- 83960\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14826    0     0  100 14826      0    98k --:--:-- --:--:-- --:--:--  102k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 10186    0     0  100 10186      0  71356 --:--:-- --:--:-- --:--:-- 74350\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13919    0     0  100 13919      0  98207 --:--:-- --:--:-- --:--:--   99k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  5119    0     0  100  5119      0  35875 --:--:-- --:--:-- --:--:-- 37364\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13225    0     0  100 13225      0  92859 --:--:-- --:--:-- --:--:-- 96532\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 12140    0     0  100 12140      0  72654 --:--:-- --:--:-- --:--:-- 74938\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 16654    0     0  100 16654      0  76682 --:--:-- --:--:-- --:--:-- 78928\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13156    0     0  100 13156      0  89533 --:--:-- --:--:-- --:--:-- 93304\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 12213    0     0  100 12213      0  82791 --:--:-- --:--:-- --:--:-- 86007\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 15706    0     0  100 15706      0  85031 --:--:-- --:--:-- --:--:-- 87743\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 11683    0     0  100 11683      0  76916 --:--:-- --:--:-- --:--:-- 79476\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 15007    0     0  100 15007      0  98273 --:--:-- --:--:-- --:--:--  101k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13653    0     0  100 13653      0  93506 --:--:-- --:--:-- --:--:-- 96829\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 11916    0     0  100 11916      0  79548 --:--:-- --:--:-- --:--:-- 82750\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14595    0     0  100 14595      0  97452 --:--:-- --:--:-- --:--:--   98k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  8658    0     0  100  8658      0  62330 --:--:-- --:--:-- --:--:-- 65097\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14119    0     0  100 14119      0  89873 --:--:-- --:--:-- --:--:-- 92888\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 27177    0     0  100 27177      0   175k --:--:-- --:--:-- --:--:--  181k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 15432    0     0  100 15432      0   101k --:--:-- --:--:-- --:--:--  105k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14827    0     0  100 14827      0   102k --:--:-- --:--:-- --:--:--  106k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 11524    0     0  100 11524      0  76885 --:--:-- --:--:-- --:--:-- 80027\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  8790    0     0  100  8790      0  62589 --:--:-- --:--:-- --:--:-- 65111\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 20800    0     0  100 20800      0   131k --:--:-- --:--:-- --:--:--  136k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14599    0     0  100 14599      0  96572 --:--:-- --:--:-- --:--:-- 99993\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13307    0     0  100 13307      0  89594 --:--:-- --:--:-- --:--:-- 93055\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13058    0     0  100 13058      0  90910 --:--:-- --:--:-- --:--:-- 94623\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 12722    0     0  100 12722      0  89936 --:--:-- --:--:-- --:--:-- 93544\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14774    0     0  100 14774      0    98k --:--:-- --:--:-- --:--:--  103k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 27350    0     0  100 27350      0   172k --:--:-- --:--:-- --:--:--  178k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 16750    0     0  100 16750      0  87317 --:--:-- --:--:-- --:--:-- 89572\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 12445    0     0  100 12445      0  69610 --:--:-- --:--:-- --:--:-- 71936\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14083    0     0  100 14083      0  84497 --:--:-- --:--:-- --:--:-- 87472\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 18672    0     0  100 18672      0   105k --:--:-- --:--:-- --:--:--  108k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14911    0     0  100 14911      0  81255 --:--:-- --:--:-- --:--:-- 84242\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13237    0     0  100 13237      0  64263 --:--:-- --:--:-- --:--:-- 65855\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 12186    0     0  100 12186      0  58958 --:--:-- --:--:-- --:--:-- 60930\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13427    0     0  100 13427      0  64060 --:--:-- --:--:-- --:--:-- 66142\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14652    0     0  100 14652      0  94452 --:--:-- --:--:-- --:--:-- 98335\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 21276    0     0  100 21276      0    98k --:--:-- --:--:-- --:--:--  100k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13066    0     0  100 13066      0  85923 --:--:-- --:--:-- --:--:-- 89493\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  6097    0     0  100  6097      0  37022 --:--:-- --:--:-- --:--:-- 38588\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 26953    0     0  100 26953      0   163k --:--:-- --:--:-- --:--:--  169k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 10892    0     0  100 10892      0  64775 --:--:-- --:--:-- --:--:-- 67234\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 17937    0     0  100 17937      0   131k --:--:-- --:--:-- --:--:--  136k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13936    0     0  100 13936      0  80028 --:--:-- --:--:-- --:--:-- 82461\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 11841    0     0  100 11841      0  70178 --:--:-- --:--:-- --:--:-- 72644\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14455    0     0  100 14455      0  77118 --:--:-- --:--:-- --:--:-- 79861\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 28282    0     0  100 28282      0   121k --:--:-- --:--:-- --:--:--  124k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13598    0     0  100 13598      0  71845 --:--:-- --:--:-- --:--:-- 75966\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 38674    0     0  100 38674      0   162k --:--:-- --:--:-- --:--:--  166k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 12574    0     0  100 12574      0  52832 --:--:-- --:--:-- --:--:-- 56133\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13100    0     0  100 13100      0  73754 --:--:-- --:--:-- --:--:-- 81366\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 12867    0     0  100 12867      0  81045 --:--:-- --:--:-- --:--:-- 86355\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13846    0     0  100 13846      0  79961 --:--:-- --:--:-- --:--:-- 82910\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 18419    0     0  100 18419      0   103k --:--:-- --:--:-- --:--:--  105k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  7145    0     0  100  7145      0  49546 --:--:-- --:--:-- --:--:-- 51402\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 11842    0     0  100 11842      0  63154 --:--:-- --:--:-- --:--:-- 65425\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 10217    0     0  100 10217      0  68490 --:--:-- --:--:-- --:--:-- 71447\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13623    0     0  100 13623      0  70744 --:--:-- --:--:-- --:--:-- 73241\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13484    0     0  100 13484      0  75559 --:--:-- --:--:-- --:--:-- 78395\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14590    0     0  100 14590      0  80477 --:--:-- --:--:-- --:--:-- 83850\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 16463    0     0  100 16463      0  95683 --:--:-- --:--:-- --:--:-- 99174\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14041    0     0  100 14041      0  96550 --:--:-- --:--:-- --:--:--   97k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13937    0     0  100 13937      0  92367 --:--:-- --:--:-- --:--:-- 96117\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 18396    0     0  100 18396      0   118k --:--:-- --:--:-- --:--:--  123k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 15338    0     0  100 15338      0  93812 --:--:-- --:--:-- --:--:-- 96465\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13574    0     0  100 13574      0  89218 --:--:-- --:--:-- --:--:-- 92972\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13134    0     0  100 13134      0  81279 --:--:-- --:--:-- --:--:-- 84735\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13298    0     0  100 13298      0  87679 --:--:-- --:--:-- --:--:-- 91082\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13619    0     0  100 13619      0   103k --:--:-- --:--:-- --:--:--  108k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 19404    0     0  100 19404      0   119k --:--:-- --:--:-- --:--:--  123k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 18971    0     0  100 18971      0   118k --:--:-- --:--:-- --:--:--  121k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 16593    0     0  100 16593      0    98k --:--:-- --:--:-- --:--:--  101k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 15727    0     0  100 15727      0  96350 --:--:-- --:--:-- --:--:--   98k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13742    0     0  100 13742      0  90068 --:--:-- --:--:-- --:--:-- 94123\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 12759    0     0  100 12759      0  83389 --:--:-- --:--:-- --:--:-- 86795\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 12942    0     0  100 12942      0  84901 --:--:-- --:--:-- --:--:-- 88643\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  9263    0     0  100  9263      0  61241 --:--:-- --:--:-- --:--:-- 63445\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 37468    0     0  100 37468      0   197k --:--:-- --:--:-- --:--:--  205k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14569    0     0  100 14569      0  55500 --:--:-- --:--:-- --:--:-- 56688\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14298    0     0  100 14298      0  79068 --:--:-- --:--:-- --:--:-- 82172\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 11154    0     0  100 11154      0  62594 --:--:-- --:--:-- --:--:-- 64848\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 12687    0     0  100 12687      0  73417 --:--:-- --:--:-- --:--:-- 75517\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 10676    0     0  100 10676      0  73643 --:--:-- --:--:-- --:--:-- 76257\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14259    0     0  100 14259      0  82410 --:--:-- --:--:-- --:--:-- 85383\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  4489    0     0  100  4489      0  28978 --:--:-- --:--:-- --:--:-- 30127\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13760    0     0  100 13760      0  91183 --:--:-- --:--:-- --:--:-- 94896\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 17883    0     0  100 17883      0   106k --:--:-- --:--:-- --:--:--  109k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14365    0     0  100 14365      0  77890 --:--:-- --:--:-- --:--:-- 79805\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 16760    0     0  100 16760      0  88243 --:--:-- --:--:-- --:--:-- 91086\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14621    0     0  100 14621      0  79099 --:--:-- --:--:-- --:--:-- 82140\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14017    0     0  100 14017      0  70755 --:--:-- --:--:-- --:--:-- 73387\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13327    0     0  100 13327      0  85439 --:--:-- --:--:-- --:--:-- 88846\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 15396    0     0  100 15396      0  98898 --:--:-- --:--:-- --:--:--   99k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 12680    0     0  100 12680      0  85142 --:--:-- --:--:-- --:--:-- 88671\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 19865    0     0  100 19865      0   116k --:--:-- --:--:-- --:--:--  120k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 19793    0     0  100 19793      0  98050 --:--:-- --:--:-- --:--:--   98k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13714    0     0  100 13714      0  93291 --:--:-- --:--:-- --:--:-- 97262\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 15611    0     0  100 15611      0  90273 --:--:-- --:--:-- --:--:-- 93479\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 24768    0     0  100 24768      0   119k --:--:-- --:--:-- --:--:--  123k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 12203    0     0  100 12203      0  73430 --:--:-- --:--:-- --:--:-- 76748\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 15300    0     0  100 15300      0  83011 --:--:-- --:--:-- --:--:-- 85474\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 36300    0     0  100 36300      0   154k --:--:-- --:--:-- --:--:--  158k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 12194    0     0  100 12194      0  71809 --:--:-- --:--:-- --:--:-- 73903\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 11872    0     0  100 11872      0  66069 --:--:-- --:--:-- --:--:-- 68229\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13797    0     0  100 13797      0  76149 --:--:-- --:--:-- --:--:-- 78840\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13739    0     0  100 13739      0  88326 --:--:-- --:--:-- --:--:-- 92208\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14976    0     0  100 14976      0  87742 --:--:-- --:--:-- --:--:-- 90763\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14464    0     0  100 14464      0  86038 --:--:-- --:--:-- --:--:-- 88736\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13023    0     0  100 13023      0  75348 --:--:-- --:--:-- --:--:-- 77517\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 18256    0     0  100 18256      0   102k --:--:-- --:--:-- --:--:--  106k\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  9646    0     0  100  9646      0  52619 --:--:-- --:--:-- --:--:-- 54497\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13363    0     0  100 13363      0  73195 --:--:-- --:--:-- --:--:-- 75926\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14472    0     0  100 14472      0  75237 --:--:-- --:--:-- --:--:-- 77390\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 15079    0     0  100 15079      0  89493 --:--:-- --:--:-- --:--:-- 94243\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 16973    0     0  100 16973      0  90342 --:--:-- --:--:-- --:--:-- 93258\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  9588    0     0  100  9588      0  63800 --:--:-- --:--:-- --:--:-- 66583\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14772    0     0  100 14772      0  89781 --:--:-- --:--:-- --:--:-- 92905\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 15189    0     0  100 15189      0  89655 --:--:-- --:--:-- --:--:-- 92615\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13691    0     0  100 13691      0  88986 --:--:-- --:--:-- --:--:-- 91885\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14833    0     0  100 14833      0  80609 --:--:-- --:--:-- --:--:-- 82865\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 13305    0     0  100 13305      0  63136 --:--:-- --:--:-- --:--:-- 71149\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 10267    0     0  100 10267      0  56874 --:--:-- --:--:-- --:--:-- 61113\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 14664    0     0  100 14664      0  90976 --:--:-- --:--:-- --:--:-- 94606\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 15157    0     0  100 15157      0  82084 --:--:-- --:--:-- --:--:-- 84205\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 12987    0     0  100 12987      0  66353 --:--:-- --:--:-- --:--:-- 68352\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  9138    0     0  100  9138      0  49035 --:--:-- --:--:-- --:--:-- 51627\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 16049    0     0  100 16049      0  80338 --:--:-- --:--:-- --:--:-- 82726\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0"
     ]
    }
   ],
   "source": [
    "gd.upload_ttl_folder_in_graphdb_repository(wikidata_folder, graphdb_url, project_name, wd_graph_name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Traitements pour créer / importer des données"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Requêtes SPARQL pour construire le graphe des rues de Paris à partir de Wikidata"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    ":warning: Impossible de chaîner les requêtes sur le endpoint de Wikidata, d'où la séparation de celles-ci sous plusieurs variables\n",
    "\n",
    "Note : `wd:Q16024163` décrit l'élément `réseau viaire de Paris` donc le triplet `?street p:P361 [ps:P361 wd:Q16024163].` permet de sélectionner les élements qui font partie de ce réseau. `wd:Q107311481` est similaire à la différence qu'il décrit l'élément `anciennes voies de Paris`.\n",
    "\n",
    "* `query_1` : sélection des voies de Paris avec leur label, leurs potentiels alias, ainsi que leur localisation (arrondissements et/ou quartiers)\n",
    "* `query_2` : sélection des voies de Paris avec l'ensemble de leur nom officiel avec si elles existent les dates de début et de fin de validité du nom officiel pour la voie\n",
    "* `query_3` : sélection (si elles existent) des dates de création et de disparition des voies de Paris\n",
    "* `query_4` : sélection des arrondissements de Paris avec leur label, leurs potentiels alias et leur localisation (qui est normalement Paris, ie `wd:Q90`)\n",
    "* `query_5` : similaire à `query_4` mais repose sur les quartiers de Paris (leur localisation est normalement un arrondissement)\n",
    "* `query_6` : récupération de données sur la ville de Paris (label, alias)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  1883    0  1883    0     0   9813      0 --:--:-- --:--:-- --:--:-- 10403\n"
     ]
    }
   ],
   "source": [
    "# Récupération de l'URI des graphes à partir de leur nom\n",
    "wd_graph_name_uri = gd.get_graph_uri_from_name(graphdb_url, project_name, wd_graph_name)\n",
    "addr_graph_name_uri = gd.get_graph_uri_from_name(graphdb_url, project_name, addr_graph_name)\n",
    "\n",
    "# Récupération des préfixes pour les requêtes\n",
    "prefixes = gd.get_repository_prefixes(graphdb_url, project_name)\n",
    "prefixes += f\"\\nPREFIX ofn:<http://www.ontotext.com/sparql/functions/>\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Structurer les rues de Paris, et les zones selon notre modèle\n",
    "\n",
    "# Vider le graphe `addr_graph_name_uri`\n",
    "query0 = prefixes + f\"\"\"\n",
    "DELETE {{ ?s ?p ?o }}\n",
    "WHERE {{ GRAPH <{addr_graph_name_uri}> {{ ?s ?p ?o }} }}\n",
    "\"\"\"\n",
    "\n",
    "# Création des rues de Paris et ajout d'un lien owl:sameAs avec son équivalent sur Wikidata\n",
    "query1 = prefixes + f\"\"\"\n",
    "INSERT {{ GRAPH <{addr_graph_name_uri}> {{\n",
    "  ?landmark a addr:Landmark;\n",
    "           addr:isLandmarkType addr:Thoroughfare;\n",
    "           addr:hasAttribute ?attrName;\n",
    "           owl:sameAs ?street.\n",
    "  ?attrName a addr:Attribute; addr:isAttributeType addr:NameAttribute.\n",
    "}} }}\n",
    "WHERE {{\n",
    "  {{ ?street p:P361 [ps:P361 wd:Q16024163]. }}\n",
    "  UNION\n",
    "  {{ ?street p:P361 [ps:P361 wd:Q107311481]. }}\n",
    "  BIND(IF(1=1, URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#LM_\", STRUUID())), ?x) AS ?landmark)\n",
    "  BIND(IF(1=1, URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#AN_\", STRUUID())), ?x) AS ?attrName)\n",
    "  }}\n",
    "\"\"\"\n",
    "\n",
    "query2 = prefixes + f\"\"\"\n",
    "INSERT {{ GRAPH <{addr_graph_name_uri}> {{\n",
    " ?landmark rdfs:label ?streetLabel;\n",
    "           skos:altLabel ?streetAltLabel;\n",
    "           addr:within ?loc ;\n",
    "           addr:hasAttribute ?officialNameAttr.\n",
    "}} }}\n",
    "WHERE {{\n",
    "  ?landmark a addr:Landmark; addr:isLandmarkType addr:Thoroughfare; owl:sameAs ?street.\n",
    "  ?street wdt:P131 ?loc.\n",
    "  ?street rdfs:label ?streetLabel.\n",
    "  FILTER (LANG(?streetLabel) = \"fr\")\n",
    "  OPTIONAL {{?street skos:altLabel ?streetAltLabel. FILTER (LANG(?streetAltLabel) = \"fr\")}}\n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "# Obtention des noms officiels des rues\n",
    "query3 = prefixes + f\"\"\"\n",
    "INSERT {{ GRAPH <{addr_graph_name_uri}> {{\n",
    "  ?attrName addr:version ?attrNameVersion.\n",
    "  ?attrNameVersion owl:sameAs ?officialNameSt; a addr:AttributeVersion; addr:value ?officialName.\n",
    "  ?startEvent a addr:Event; addr:hasTime ?startTimeInstant.\n",
    "  ?endEvent a addr:Event; addr:hasTime ?endTimeInstant.\n",
    "  ?startChange a addr:AttributeChange; addr:isChangeType addr:NameChange; addr:dependsOn ?startEvent; addr:appliedTo ?attrName; addr:after ?attrNameVersion.\n",
    "  ?endChange a addr:AttributeChange; addr:isChangeType addr:NameChange; addr:dependsOn ?endEvent; addr:appliedTo ?attrName; addr:before ?attrNameVersion.\n",
    "  ?startTimeInstant a addr:TimeInstant; addr:timeStamp ?startDateValue; addr:timePrecision ?startDatePrec; addr:timeCalendar ?startDateCal.\n",
    "  ?endTimeInstant a addr:TimeInstant; addr:timeStamp ?endDateValue; addr:timePrecision ?endDatePrec; addr:timeCalendar ?endDateCal.\n",
    "}} }}\n",
    "WHERE {{\n",
    "  ?landmark a addr:Landmark; addr:isLandmarkType addr:Thoroughfare; owl:sameAs [p:P1448 ?officialNameSt]; addr:hasAttribute ?attrName.\n",
    "  ?attrName a addr:Attribute; addr:isAttributeType addr:NameAttribute.\n",
    "  ?officialNameSt ps:P1448 ?officialName.\n",
    "  OPTIONAL{{?officialNameSt pqv:P580 [wikibase:timeValue ?startDateValue; wikibase:timePrecision ?startDatePrec; wikibase:timeCalendarModel ?startDateCal]}}\n",
    "  OPTIONAL{{?officialNameSt pqv:P582 [wikibase:timeValue ?endDateValue; wikibase:timePrecision ?endDatePrec; wikibase:timeCalendarModel ?endDateCal]}}\n",
    "  FILTER (LANG(?officialName) = \"fr\")\n",
    "  BIND(IF(1=1, URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#ANV_\", STRUUID())), ?x) AS ?attrNameVersion)\n",
    "  BIND(IF(1=1, URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#EV_\", STRUUID())), ?x) AS ?startEvent)\n",
    "  BIND(IF(1=1, URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#CH_\", STRUUID())), ?x) AS ?startChange)\n",
    "  BIND(IF(1=1, URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#EV_\", STRUUID())), ?x) AS ?endEvent)\n",
    "  BIND(IF(1=1, URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#CH_\", STRUUID())), ?x) AS ?endChange)\n",
    "  BIND(IF(1=1, URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#TE_\", STRUUID())), ?x) AS ?startTimeInstant)\n",
    "  BIND(IF(1=1, URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#TE_\", STRUUID())), ?x) AS ?endTimeInstant)\n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "# Obtention des dates de création et des dissolution des rues\n",
    "query4 = prefixes + f\"\"\"\n",
    "INSERT {{ GRAPH <{addr_graph_name_uri}> {{\n",
    "  ?startEvent a addr:Event; addr:hasTime ?startTimeInstant.\n",
    "  ?endEvent a addr:Event; addr:hasTime ?endTimeInstant.\n",
    "  ?startChange a addr:LandmarkChange; addr:isChangeType addr:Creation; addr:appliedTo ?landmark; addr:dependsOn ?startEvent.\n",
    "  ?endChange a addr:LandmarkChange; addr:isChangeType addr:Dissolution; addr:appliedTo ?landmark; addr:dependsOn ?endEvent.\n",
    "  ?startTimeInstant a addr:TimeInstant; addr:timeStamp ?creationTimeValue; addr:timePrecision ?creationTimePrec; addr:timeCalendar ?creationTimeCal.\n",
    "  ?endTimeInstant a addr:TimeInstant; addr:timeStamp ?dissolutionTimeValue; addr:timePrecision ?dissolutionTimePrec; addr:timeCalendar ?dissolutionTimeCal.\n",
    "}} }}\n",
    "WHERE {{\n",
    "  ?landmark a addr:Landmark; addr:isLandmarkType addr:Thoroughfare; owl:sameAs ?street.\n",
    "  OPTIONAL {{ ?street p:P571 [psv:P571 [wikibase:timeValue ?creationTimeValue; wikibase:timePrecision ?creationTimePrec; wikibase:timeCalendarModel ?creationTimeCal]]. }}\n",
    "  OPTIONAL {{ ?street p:P576 [psv:P576 [wikibase:timeValue ?dissolutionTimeValue; wikibase:timePrecision ?dissolutionTimePrec; wikibase:timeCalendarModel ?dissolutionTimeCal]]. }}\n",
    "  BIND(IF(1=1, URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#EV_\", STRUUID())), ?x) AS ?startEvent)\n",
    "  BIND(IF(1=1, URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#CH_\", STRUUID())), ?x) AS ?startChange)\n",
    "  BIND(IF(1=1, URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#EV_\", STRUUID())), ?x) AS ?endEvent)\n",
    "  BIND(IF(1=1, URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#CH_\", STRUUID())), ?x) AS ?endChange)\n",
    "  BIND(IF(1=1, URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#TE_\", STRUUID())), ?x) AS ?startTimeInstant)\n",
    "  BIND(IF(1=1, URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#TE_\", STRUUID())), ?x) AS ?endTimeInstant)\n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "# Données relatives aux arrondissements de Paris\n",
    "query5 = prefixes + f\"\"\"\n",
    "INSERT {{ GRAPH <{addr_graph_name_uri}> {{\n",
    "  ?landmark a addr:Landmark;\n",
    "           addr:isLandmarkType addr:District;\n",
    "           rdfs:label ?arrdtLabel;\n",
    "           skos:altLabel ?arrdtAltLabel;\n",
    "           addr:within wd:Q90;\n",
    "           addr:startDate ?startDate;\n",
    "           owl:sameAs ?arrdt.\n",
    "}} }}\n",
    "WHERE {{\n",
    "  ?arrdt wdt:P31 wd:Q702842; p:P131 [ps:P131 wd:Q90]; rdfs:label ?arrdtLabel; skos:altLabel ?arrdtAltLabel.\n",
    "  FILTER(LANG(?arrdtLabel) = \"fr\" && LANG(?arrdtAltLabel) = \"fr\")\n",
    "  OPTIONAL {{?arrdt wdt:P571 ?startDate}}\n",
    "  BIND(IF(1=1, URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#LM_\", STRUUID())), ?x) AS ?landmark)\n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "# Données relatives aux quartiers administratifs de Paris\n",
    "query6 = prefixes + f\"\"\"\n",
    "INSERT {{ GRAPH <{addr_graph_name_uri}> {{\n",
    "  ?landmark a addr:Landmark;\n",
    "           addr:isLandmarkType addr:District;\n",
    "           rdfs:label ?quartierLabel;\n",
    "           skos:altLabel ?quartierAltLabel;\n",
    "           addr:within ?loc; \n",
    "           owl:sameAs ?quartier.\n",
    "}} }}\n",
    "WHERE {{\n",
    "  BIND(IF(1=1, URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#LM_\", STRUUID())), ?x) AS ?landmark)\n",
    "  ?quartier wdt:P31 wd:Q252916; rdfs:label ?quartierLabel; skos:altLabel ?quartierAltLabel; p:P131 [ps:P131 ?loc].\n",
    "  FILTER(LANG(?quartierLabel) = \"fr\" && LANG(?quartierAltLabel) = \"fr\")\n",
    "  BIND(IF(1=1, URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#LM_\", STRUUID())), ?x) AS ?landmark)\n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "# Données relatives à la ville de Paris\n",
    "query7 = prefixes + f\"\"\"\n",
    "INSERT {{ GRAPH <{addr_graph_name_uri}> {{\n",
    "  ?landmark a addr:Landmark;\n",
    "           addr:isLandmarkType addr:City;\n",
    "           rdfs:label ?parisLabel;\n",
    "           skos:altLabel ?parisAltLabel;\n",
    "           owl:sameAs ?paris.\n",
    "}} }}\n",
    "WHERE {{\n",
    "  BIND (wd:Q90 AS ?paris)\n",
    "  ?paris rdfs:label ?parisLabel; skos:altLabel ?parisAltLabel.\n",
    "  FILTER(LANG(?parisLabel) = \"fr\" && LANG(?parisAltLabel) = \"fr\")\n",
    "  BIND(IF(1=1, URI(CONCAT(\"http://rdf.geohistoricaldata.org/address#LM_\", STRUUID())), ?x) AS ?landmark)\n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "wiki_queries = [query0, query1, query2, query3, query4, query5, query6, query7]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Création d'un graphe nommé stockant les rues selon l'ontologie définie à partir des données de Wikidata"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  3164    0     0  100  3164      0   5611 --:--:-- --:--:-- --:--:--  5680\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  3974    0     0  100  3974      0   1343  0:00:02  0:00:02 --:--:--  1345\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  3805    0     0  100  3805      0   1511  0:00:02  0:00:02 --:--:--  1514\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  6217    0     0  100  6217      0     92  0:01:07  0:01:07 --:--:--     0\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  5595    0     0  100  5595      0    804  0:00:06  0:00:06 --:--:--     0\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  4079    0     0  100  4079      0  23563 --:--:-- --:--:-- --:--:-- 24279\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  4131    0     0  100  4131      0    793  0:00:05  0:00:05 --:--:--     0\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  3853    0     0  100  3853      0  17209 --:--:-- --:--:-- --:--:-- 17674\n"
     ]
    }
   ],
   "source": [
    "for query in wiki_queries:\n",
    "    gd.update_query(query, graphdb_url, project_name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Traitements après l'import de données\n",
    "\n",
    "* `loc_query_1` : \n",
    "    * ajoute un élément de classe `addr:Attribute` relatif au nom de la voie qui permet d'avoir l'ensemble des noms officiels que cette dernière a porté durant son existence. Il est lié à la voie via le prédicat `addr:hasAttribute` ;\n",
    "    * `BIND(URI(...) AS ?z)` est appelé deux fois afin que `?attrName` soit unique pour chaque rue (sinon il possède la même valeur tout le temps).\n",
    "* `loc_query_2` : lors de la construction du graphe via les requêtes de la section précédente, les versions des noms sont liées directement aux voies (`?voie ?aPourVersionDeNom ?nomVersion`). Cette requête supprime ce triplet et associe `nomVersion` a l'élément crée grâce à `loc_query_1`. Ainsi, on a : `?voie ?aPourAttributDeNom ?nomAttribut. ?nomAttribut ?aPourVersionDeNom ?nomVersion.`\n",
    "* `loc_query_3` : fusion d'éléments de type `addr:Event` qui sont équivalents."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "loc_query_0 = prefixes + f\"\"\"\n",
    "DELETE {{ \n",
    "    ?timeInstant addr:timePrecision ?timePrecision.\n",
    "}}\n",
    "INSERT {{ GRAPH <{addr_graph_name_uri}> {{\n",
    "    ?timeInstant addr:timePrecision ?timeUnit.\n",
    "}} }}\n",
    "WHERE {{ GRAPH <{addr_graph_name_uri}> {{\n",
    "    ?timeInstant a addr:TimeInstant; addr:timePrecision ?timePrecision.\n",
    "        BIND(IF(?timePrecision = 11, time:unitDay, \n",
    "                IF(?timePrecision = 10, time:unitMonth,\n",
    "                    IF(?timePrecision = 9, time:unitYear,\n",
    "                        IF(?timePrecision = 8, time:unitDecade,\n",
    "                            IF(?timePrecision = 7, time:unitCentury,\n",
    "                                IF(?timePrecision = 6, time:unitMillenium, ?x\n",
    "                            )))))) AS ?timeUnit)\n",
    "    }} }}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "loc_query_1 = prefixes + f\"\"\"\n",
    "\n",
    "DELETE {{\n",
    "    ?change1 ?p ?o.\n",
    "    ?event1 ?pe ?oe.\n",
    "    ?se ?pe ?event1.\n",
    "    ?timeInstant1 a addr:timeInstant; addr:timeStamp ?timeStamp1; addr:timePrecision ?timePrec1; addr:timeCalendar ?timeCal1.\n",
    "}}\n",
    "INSERT {{ GRAPH <{addr_graph_name_uri}> {{\n",
    "    ?change2 addr:before ?attrNameVersion1.\n",
    "}} }}\n",
    "WHERE {{\n",
    "    ?attrName a addr:Attribute; addr:isAttributeType addr:NameAttribute; addr:version ?attrNameVersion1, ?attrNameVersion2.\n",
    "    ?attrNameVersion1 a addr:AttributeVersion.\n",
    "    ?attrNameVersion2 a addr:AttributeVersion.\n",
    "    FILTER (?attrNameVersion1 != ?attrNameVersion2)\n",
    "    ?change1 a addr:AttributeChange; addr:before ?attrNameVersion1; addr:dependsOn ?event1.\n",
    "    ?event1 a addr:Event; addr:hasTime ?timeInstant1. \n",
    "    ?timeInstant1 a addr:TimeInstant; addr:timeStamp ?timeStamp1; addr:timePrecision ?timePrec1; addr:timeCalendar ?timeCal1.\n",
    "    ?change2 a addr:AttributeChange; addr:after ?attrNameVersion2; addr:dependsOn [a addr:Event; addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeStamp2; addr:timePrecision ?timePrec2; addr:timeCalendar ?timeCal2]].\n",
    "    BIND(ofn:asDays(?timeStamp2 - ?timeStamp1) AS ?diffTime)\n",
    "    FILTER(?diffTime >= 0.0 && ?timeCal1 = ?timeCal2)\n",
    "    FILTER ((?diffTime <= 1.0 && ?timePrec1 = time:unitDay && ?timePrec2 = time:unitDay) ||\n",
    "         (?diffTime <= 0 && ?timePrec1 != time:unitDay && ?timePrec2 != time:unitDay))\n",
    "    ?change1 ?p ?o.\n",
    "    {{?event1 ?pe ?oe}}UNION{{?se ?pe ?event1}}\n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "loc_query_2 = prefixes + f\"\"\"\n",
    "DELETE {{\n",
    "    ?creaEv ?p ?o.\n",
    "    ?s ?p ?creaEv.\n",
    "    ?crevEvTime a addr:TimeInstant; addr:timePrecision ?creaEvTimePrec; addr:timeStamp ?creaEvTimeVal; addr:timeCalendar ?creaEvTimeCal.\n",
    "}}\n",
    "INSERT {{ GRAPH <{addr_graph_name_uri}> {{\n",
    "    ?lmCrea addr:dependsOn ?attrNameEv.\n",
    "}} }}\n",
    "WHERE {{\n",
    "    ?lmCrea a addr:LandmarkChange; addr:isChangeType addr:Creation; addr:appliedTo ?landmark; addr:dependsOn ?creaEv.\n",
    "    ?creaEv a addr:Event; addr:hasTime ?crevEvTime.\n",
    "    ?crevEvTime a addr:TimeInstant; addr:timePrecision ?creaEvTimePrec; addr:timeStamp ?creaEvTimeVal; addr:timeCalendar ?creaEvTimeCal.\n",
    "    ?landmark a addr:Landmark; addr:isLandmarkType addr:Thoroughfare; addr:hasAttribute ?nameAttr.\n",
    "    ?attrNameChange a addr:AttributeChange; addr:appliedTo ?nameAttr; addr:dependsOn ?attrNameEv.\n",
    "    ?attrNameEv a addr:Event; addr:hasTime ?attrNameEvTime. \n",
    "    ?attrNameEvTime a addr:TimeInstant; addr:timePrecision ?newNameEvTimePrec; addr:timeStamp ?newNameEvTimeVal; addr:timeCalendar ?newNameEvTimeCal.\n",
    "    FILTER(?attrNameEv != ?creaEv)\n",
    "    BIND(ofn:asDays(?creaEvTimeVal - ?newNameEvTimeVal) AS ?diffTime)\n",
    "    FILTER(?diffTime >= 0.0 && ?newNameEvTimeCal = ?creaEvTimeCal)\n",
    "    FILTER ((?diffTime <= 1.0 && ?creaEvTimePrec = time:unitDay && ?newNameEvTimePrec = time:unitDay) ||\n",
    "         (?diffTime <= 0 && ?creaEvTimePrec != time:unitDay && ?timePrec2 != time:newNameEvTimePrec))\n",
    "        {{?creaEv ?p ?o}}UNION{{?s ?p ?creaEv}}\n",
    "}}\n",
    "\"\"\"\n",
    "\n",
    "loc_queries = [loc_query_0, loc_query_1, loc_query_2]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Nettoyage des données en fusionnant certains événements et changements"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  3853    0     0  100  3853      0   6356 --:--:-- --:--:-- --:--:--  6530\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  3853    0     0  100  3853      0  14614 --:--:-- --:--:-- --:--:-- 14876\n",
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  3853    0     0  100  3853      0  14769 --:--:-- --:--:-- --:--:-- 15229\n"
     ]
    }
   ],
   "source": [
    "for loc_query in loc_queries:\n",
    "    gd.update_query(query, graphdb_url, project_name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Requêtes pour faire des sélections dans le graphe"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Sélection des noms qu'a pris la place de la Nation durant sa vie\n",
    "query = \"\"\"\n",
    "PREFIX addr: <http://rdf.geohistoricaldata.org/address#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "\n",
    "select ?street ?name ?timeValueStart ?timeValueEnd where { \n",
    "\t?street a addr:Landmark; addr:isLandmarkType addr:Thoroughfare; addr:hasAttribute ?attrName; (rdfs:label|skos:altLabel) \"place de la Nation\"@fr.\n",
    "    ?attrName a addr:Attribute; addr:isAttributeType addr:NameAttribute; addr:version ?attrNameVersion.\n",
    "    ?attrNameVersion addr:value ?name.\n",
    "    ?changeEnd addr:before ?attrNameVersion; addr:appliedTo ?attrName; addr:dependsOn ?eventEnd.\n",
    "    ?changeStart addr:after ?attrNameVersion; addr:appliedTo ?attrName; addr:dependsOn ?eventStart.\n",
    "    ?eventEnd a addr:Event.\n",
    "    ?eventStart a addr:Event.\n",
    "    OPTIONAL {?eventEnd addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValueEnd]}\n",
    "    OPTIONAL {?eventEnd addr:hasTime [a addr:TimeInstant; addr:timePrecision ?timePrecisionEnd]}\n",
    "    OPTIONAL {?eventEnd addr:hasTime [a addr:TimeInstant; addr:timeCalendar ?timeCalendarEnd]}\n",
    "    OPTIONAL {?eventStart addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValueStart]}\n",
    "    OPTIONAL {?eventStart addr:hasTime [a addr:TimeInstant; addr:timePrecision ?timePrecisionStart]}\n",
    "    OPTIONAL {?eventStart addr:hasTime [a addr:TimeInstant; addr:timeCalendar ?timeCalendarStart]}\n",
    "\"\"\" \n",
    "\n",
    "# Sélection de l'historique des noms de la place de la Nation avec les dates\n",
    "query = \"\"\"\n",
    "PREFIX addr: <http://rdf.geohistoricaldata.org/address#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "\n",
    "select ?street ?change ?event ?timeValue ?timePrecision ?timeCalendar ?beforeVersion ?afterVersion where { \n",
    "\t?street a addr:Landmark; addr:isLandmarkType addr:Thoroughfare; addr:hasAttribute ?attrName; (rdfs:label|skos:altLabel) \"place de la Nation\"@fr.\n",
    "    ?attrName a addr:Attribute; addr:isAttributeType addr:NameAttribute.\n",
    "    ?change addr:appliedTo ?attrName; addr:dependsOn ?event.\n",
    "    ?event a addr:Event.\n",
    "    OPTIONAL {?event addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValue]}\n",
    "    OPTIONAL {?event addr:hasTime [a addr:TimeInstant; addr:timePrecision ?timePrecision]}\n",
    "    OPTIONAL {?event addr:hasTime [a addr:TimeInstant; addr:timeCalendar ?timeCalendar]}\n",
    "    OPTIONAL {?change addr:before [addr:value ?beforeVersion]}\n",
    "    OPTIONAL {?change addr:after [addr:value ?afterVersion]}\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "# Sélection du nom de la place de la Nation à une date donnée\n",
    "query = \"\"\"\n",
    "PREFIX addr: <http://rdf.geohistoricaldata.org/address#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "select ?street ?name ?selectTime where { \n",
    "\t?street a addr:Landmark; addr:isLandmarkType addr:Thoroughfare; addr:hasAttribute ?attrName; (rdfs:label|skos:altLabel) \"place de la Nation\"@fr.\n",
    "    BIND(\"1800-01-08T00:00:00\"^^xsd:dateTime AS ?selectTime)\n",
    "    ?attrName a addr:Attribute; addr:isAttributeType addr:NameAttribute; addr:version ?attrNameVersion.\n",
    "    ?attrNameVersion a addr:AttributeVersion; addr:value ?name.\n",
    "    ?change1 addr:before ?attrNameVersion; addr:dependsOn ?event1.\n",
    "    ?change2 addr:after ?attrNameVersion; addr:dependsOn ?event2.\n",
    "    ?event1 a addr:Event.\n",
    "    ?event2 a addr:Event.\n",
    "    OPTIONAL {?event1 addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValue1]}\n",
    "    OPTIONAL {?event1 addr:hasTime [a addr:TimeInstant; addr:timePrecision ?timePrecision1]}\n",
    "    OPTIONAL {?event1 addr:hasTime [a addr:TimeInstant; addr:timeCalendar ?timeCalendar1]}\n",
    "    OPTIONAL {?event2 addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValue2]}\n",
    "    OPTIONAL {?event2 addr:hasTime [a addr:TimeInstant; addr:timePrecision ?timePrecision2]}\n",
    "    OPTIONAL {?event2 addr:hasTime [a addr:TimeInstant; addr:timeCalendar ?timeCalendar2]}\n",
    "    FILTER ((?timeValue1 >= ?selectTime && ?timeValue2 <= ?selectTime && ?timeCalendar1 = ?timeCalendar2) ||\n",
    "        (?timeValue1 >= ?selectTime && !BOUND(?timeValue2)) ||\n",
    "        (?timeValue2 <= ?selectTime && !BOUND(?timeValue1))\n",
    "    ) \n",
    "}\n",
    "\"\"\" \n",
    "\n",
    "# Sélection des voies existant à une date donnée avec leur nom d'époque\n",
    "query = \"\"\"\n",
    "PREFIX addr: <http://rdf.geohistoricaldata.org/address#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "select ?street ?name where { \n",
    "    BIND(\"1900-01-08T00:00:00\"^^xsd:dateTime AS ?selectTime)\n",
    "\t?street a addr:Landmark; addr:isLandmarkType addr:Thoroughfare; addr:hasAttribute ?attrName.\n",
    "    ?changeStreet1 addr:dependsOn ?eventStreet1; addr:isChangeType addr:Dissolution; addr:appliedTo ?street.\n",
    "    ?changeStreet2 addr:dependsOn ?eventStreet2; addr:isChangeType addr:Creation; addr:appliedTo ?street.\n",
    "    ?eventStreet1 a addr:Event.\n",
    "    ?eventStreet2 a addr:Event.\n",
    "    ?attrName a addr:Attribute; addr:isAttributeType addr:NameAttribute; addr:version ?attrNameVersion.\n",
    "    ?attrNameVersion a addr:AttributeVersion; addr:value ?name.\n",
    "    ?change1 addr:before ?attrNameVersion; addr:dependsOn ?event1.\n",
    "    ?change2 addr:after ?attrNameVersion; addr:dependsOn ?event2.\n",
    "    ?event1 a addr:Event.\n",
    "    ?event2 a addr:Event.\n",
    "    OPTIONAL {?event1 addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValue1]}\n",
    "    OPTIONAL {?event1 addr:hasTime [a addr:TimeInstant; addr:timePrecision ?timePrecision1]}\n",
    "    OPTIONAL {?event1 addr:hasTime [a addr:TimeInstant; addr:timeCalendar ?timeCalendar1]}\n",
    "    OPTIONAL {?event2 addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValue2]}\n",
    "    OPTIONAL {?event2 addr:hasTime [a addr:TimeInstant; addr:timePrecision ?timePrecision2]}\n",
    "    OPTIONAL {?event2 addr:hasTime [a addr:TimeInstant; addr:timeCalendar ?timeCalendar2]}\n",
    "    OPTIONAL {?eventStreet1 addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValueStreet1]}\n",
    "    OPTIONAL {?eventStreet1 addr:hasTime [a addr:TimeInstant; addr:timePrecision ?timePrecisionStreet1]}\n",
    "    OPTIONAL {?eventStreet1 addr:hasTime [a addr:TimeInstant; addr:timeCalendar ?timeCalendarStreet1]}\n",
    "    OPTIONAL {?eventStreet2 addr:hasTime [a addr:TimeInstant; addr:timeStamp ?timeValueStreet2]}\n",
    "    OPTIONAL {?eventStreet2 addr:hasTime [a addr:TimeInstant; addr:timePrecision ?timePrecisionStreet2]}\n",
    "    OPTIONAL {?eventStreet2 addr:hasTime [a addr:TimeInstant; addr:timeCalendar ?timeCalendarStreet2]}\n",
    "    FILTER ((?timeValue1 >= ?selectTime && ?timeValue2 <= ?selectTime && ?timeCalendar1 = ?timeCalendar2) ||\n",
    "        (?timeValue1 >= ?selectTime && !BOUND(?timeValue2)) ||\n",
    "        (?timeValue2 <= ?selectTime && !BOUND(?timeValue1))\n",
    "    ) \n",
    "    FILTER ((?timeValueStreet1 >= ?selectTime && ?timeValueStreet2 <= ?selectTime && ?timeCalendarStreet1 = ?timeCalendarStreet2) ||\n",
    "        (?timeValueStreet1 >= ?selectTime && !BOUND(?timeValueStreet2)) ||\n",
    "        (?timeValueStreet2 <= ?selectTime && !BOUND(?timeValueStreet1))\n",
    "    ) \n",
    "}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Ajout des emprises de voie"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Successfully deleted project with identifier: 2687116559576\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100   99k    0     0  100   99k      0   268k --:--:-- --:--:-- --:--:--  274k\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Successfully deleted project with identifier: 2584342009058\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100  109k    0     0  100  109k      0   272k --:--:-- --:--:-- --:--:--  278k\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Successfully deleted project with identifier: 2431817778940\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 81112    0     0  100 81112      0   237k --:--:-- --:--:-- --:--:--  240k\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Successfully deleted project with identifier: 1961714364148\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current\n",
      "                                 Dload  Upload   Total   Spent    Left  Speed\n",
      "100 71257    0     0  100 71257      0   226k --:--:-- --:--:-- --:--:--  230k\n"
     ]
    }
   ],
   "source": [
    "# ontorefine_cmd = \"ontorefine-cli\"\n",
    "# ontorefine_cmd = \"/opt/ontotext-refine/lib/app/bin/ontorefine-cli\"\n",
    "ontorefine_cmd = \"/Applications/Ontotext\\ Refine.app/Contents/app/bin/ontorefine-cli\"\n",
    "ontorefine_url = \"http://localhost:7333\"\n",
    "\n",
    "sources = [\n",
    "    {\"filename\": \"andriveau_1849_am.csv\", \"mapping_file\":\"mapping_andriveau_1849_am.json\",\"graphname\":\"andriveau1849\", \"date\":\"1849-01-01\"},\n",
    "    {\"filename\": \"atlas_municipal_1888_am.csv\", \"mapping_file\":\"mapping_atlas_municipal_1888_am.json\",\"graphname\":\"atlasMunicipal1888\", \"date\":\"1888-01-01\"},\n",
    "    {\"filename\": \"piquet_1826_am.csv\", \"mapping_file\":\"mapping_piquet_1826_am.json\",\"graphname\":\"piquet1826\", \"date\":\"1826-01-01\"},\n",
    "    {\"filename\": \"verniquet_1791_am.csv\", \"mapping_file\":\"mapping_verniquet_1791_am.json\",\"graphname\":\"verniquet1791\", \"date\":\"1791-01-01\"},\n",
    "]\n",
    "\n",
    "query = \"\"\"\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "for source in sources:\n",
    "    source_file = os.path.join(source_folder, source.get(\"filename\"))\n",
    "    mapping_file = os.path.join(mapping_folder, source.get(\"mapping_file\"))\n",
    "    export_file = os.path.join(tmp_folder, source.get(\"filename\").replace(\".csv\", \".ttl\"))\n",
    "    graph_name = source.get(\"graphname\")\n",
    "    date = source.get(\"date\")\n",
    "    timestamp = f\"+{date}T00:00:00\"\n",
    "    otr.get_export_file_from_ontorefine(source_file, mapping_file, export_file, ontorefine_cmd, ontorefine_url, project_name)\n",
    "    gd.import_ttl_file_in_graphdb(graphdb_url, project_name, export_file, graph_name)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.0"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
